{
  "content": "Anomalous spin Hall and inverse spin Hall e ects in magnetic systems X. R. Wang1, 2,\u0003 1Physics Department, The Hong Kong University of Science and Technology, Clear Water Bay, Kowloon, Hong Kong 2HKUST Shenzhen Research Institute, Shenzhen 518057, China Anomalous spin-Hall e ects (SHE) and anomalous inverse spin-Hall e ects (ISHE) are predicted when the order parameters are involved in the charge-spin interconversion. A spin current whose propagation and polarization are collinear and transverse to an applied charge current can be gen- erated when the charge current is parallel to the magnetization ~Min a ferromagnet or to the Neel order ~ nin an anti-ferromagnet. When the applied charge current is perpendicular to the order parameter, two spin currents can be generated. One is the spin current polarized along the order parameter and propagating along the charge current direction. The other is the one polarized in the charge current direction and propagating along the order parameter direction. Charge currents proportional to the order parameter are generated by applied spin currents in the anomalous ISHE. When a spin current whose propagation and polarization are collinear is applied, the charge current is along the perpendicular (to the spin current) component of order parameter, and no current for order parameter along the spin current. For applied spin current with propagation and polarization mutually orthogonal to each other, a charge current along the spin current propagation direction is generated if the order parameter is collinear with the polarization of the spin current. A charge current along the polarization of spin current is generated if the order parameter is collinear with the propagation direction of the spin current. Experimental veri cations are also proposed. In terms of applications, one of the great advantages of anomalous SHE is that one can control the generated spin or charge current by controlling the magnetization or the Neel order in the magnetic materials. PACS numbers: Spin current generation, manipulation, and detection are essential themes of spintronics. Similar to electric- currents in electronics that perform all kinds of tasks, spin currents can carry and process information in spin- tronics, as well as control spin and magnetization direc- tion of memory cells [1, 2] and magnetic domain wall motion [3{6]. Di erent from an electric current that is the ow of charges, a spin current is the ow of a vector quantity of angular momenta. In the Cartesian coor- dinates, spin currents are tensor of rank two with nine components, instead of a vector for electric currents. A spin current can exert a torque on spins or on magnetic moments when passing through them, and this torque is component sensitive and useful as a control knob for manipulating spin states of nano-devices [3{6]. Spin currents can be generated in many systems and in many di erent ways [3{6], but one very attractive method is through the spin Hall e ect (SHE) originally proposed by Dyakonov and Perel [12]. Recent escalat- ing research activities on SHE and the terminology is largely due to the rediscovery of the e ect by Hirsch [13] and due to the subsequently experimental veri cations in semiconductor devices [14, 15]. This well-known SHE says that a charge current ~Jin a material with spin-orbit interaction can generate a spin current js ijpolarizing in direction ^jand owing in direction ^iwith ^i,^j, and~Jmu- tually perpendicular with each other. Thus, in the Carte- sian coordinate this spin current is js ij=\u00120~=(2e)\u000fijkJk, where\u000fijkis the Levi-Civita symbol and the Einstein summation convention is applied. \u00120is a material pa- rameter called spin Hall angle whose value is an issueof recent debates. Like action-reaction principle in na- ture, the inverse e ect of SHE is called inverse spin Hall e ect (ISHE) [16{18] that says a spin current can gen- erate a charge current of Jk=\u00120 0(2e)=(~)\u000fijkjs ij. Again the Einstein summation convention is applied and \u00120 0is called inverse spin Hall angle, and interestingly, \u00120 0=\u00120. This conventional SHE was con rmed capable of revers- ing spins of spin-orbital torque (SOT) memory [1] while the conventional ISHE becomes a standard technique for spin current detection [16{18]. From application point of view, one of the shortcomings of the spin current gen- erated from the conventional SHE is that spin-current polarization must be perpendicular to the spin-current propagation direction. It is highly desirable to generate spin currents whose polarization can be in any possible directions and controllable by other external means so that resulted torques are tunable. This is the subject of the present study. In this letter I predict the existence of new types of charge-spin interconversion in magnetic materials. Dif- fer from the existing paradigm [12, 13, 16, 17], I show, from the general requirement of a genuine physical quan- tity being a tensor, that there are, in principle, three new SHEs and ISHEs in magnetic materials when they involve the order parameters of magnetization ~Min fer- romagnets and the Neel order ~ nin anti-ferromagnets. I term them anomalous SHE and anomalous ISHE because they are linear in the order parameter. Speci cally, spin currentsjs iiare converted from a charge current collinear with the order parameter where ^iis perpendicular to the charge current. When a charge current ows perpendic-arXiv:2008.05303v1 [cond-mat.mes-hall] 12 Aug 2020\n2 ularly to the order parameter, two new spin currents js ij are generated, where directions ^iand^jare either respec- tively along electric current and order parameter or re- spectively along the order parameter and electric current. In the anomalous ISHE, a charge current along the or- der parameter is generated when a spin current js iiwith its polarization and propagation collinear ow perpen- dicularly to the order parameter. A charge current along either the spin current ow direction or polarization di- rection is generated by a spin current js ijwhen ^iand^j are mutually perpendicular to each other, and either ^ior ^jis along the order parameter. Consider a piece of ferromagnetic or anti-ferromagnetic metal with an applied charge current density ~J. I will take a ferromagnet as an example below. A spin current js ijis generated by ~J. Since spin current is a tensor of rank 2 and ~Ja tensor of rank 1, the most general rela- tionship between js ijand~J[19{21], in the linear response region, is js ij=~ 2e\u0012SH ijkJk; (1) where\u0012SH ijkis the spin-Hall angle tensor of rank 3 that does not depend on current ~J. In three dimension, i;j;k = 1;2;3 stand for respectively the x,y, andzdirections. In the absence of magnetic eld, the only available non- zero rank tensors (other than the electric current) are order parameter ~Mor~ nfor a ferromagnet or an anti- ferromagnet, as well as the Levi-Civita symbol of \u000fijk= 1 for (i;j;k ) = (1;2;3);(2;3;1);(3;1;2),\u000fijk=\u00001 for (i;j;k ) = (1;3;2;);(2;1;3;);(3;2;1), and\u000fijk= 0 for any other choices of ( i;jk). If the order parameter can also participate in the SHE, and if we restrict ourselves to the linear anomalous SHE and ISHE in ~Mor~ n(in the case of anti-ferromagnet), then the most general \u0012SH ijkin the case of ferromagnet is \u0012SH ijk=\u00120\u000fijk+\u00121Ml\u000filn\u000fjnk+\u00122Ml\u000fink\u000fjln; (2) \u00120is the usual spin Hall angle that does not interact with ~M,\u0012 ( = 1;2) are anomalous SHE coe\u000ecients. It is straight forward to see that the last two terms can be recast as [(\u00121+\u00122)\u000eij\u000ekl6=i+\u00121\u000eik\u000ejl6=i+\u00122\u000eil\u000ejk6=i]Ml:(3) In order to see what these anomalous SHEs are, we con- sider two cases: (1) The charge current is along ~M. (2) The charge current is perpendicular to ~M. Without los- ing generality, let ~Jand~Mbe along the ^ x-axis in case (1). Substituting Eqs. (2) and (3) into Eq. (1), the general SHE in magnetic materials becomes js ij=~ 2e[\u00120\u000fij1j+ (\u00121+\u00122\u000eij6=1)MJ]: (4) In case (1), spin current js 22andjs 33proportional to MJ are generated when ~Jand~Mare collinear and along the^x-axis. Fig. 1(a) is the schematic diagram of the anoma- lous SHE where the thicker and thinner red arrowed lines denote respectively the charge current source and mag- netization directions. The black arrowed line denote two two spin currents whose polarization are indicated by decorated smaller arrows. Clearly, the conventional SHE cannot generate such a spin current. xyz(a) js 33(b) MJ Mjs 22Jjs 12 js 21 FIG. 1: Schematics of anomalous SHE: (a) The charge cur- rent ~J(the thicker red arrowed line) and magnetization ~M (the thinner red arrowed line) are along the ^ x-direction. Two anomalous spin current js 22andjs 33(the black arrowed lines) proportional to Mandjare generated. (b) The charge cur- rent ~J(the thicker red arrowed line) and magnetization ~M (the thinner red arrowed line) are respectively along the ^ x- and the ^ y-directions. Two anomalous spin current js 12and js 21(the black arrowed lines with polarization decorated by the bead-arrow on the lines) proportional to MJ are gener- ated. Without losing generality, we let ~Jand~Mrespectively along the ^x- and the ^y-directions in case (2). From Eqs. (1)-(3), we have js ij=~ 2e(\u00120\u000fij1+\u00121\u000ei1\u000ej2M+\u00122\u000ei2\u000ej1M)J: (5) Eq. (5) says that spin current js 12andjs 21, proportional to the magnetization Mand propagating respectively along the ^x- and the ^y-directions, are generated. This is dif- ferent from the conventional SHE that does not allow a spin current polarized or propagating along the charge current direction. The schematic of the new anomalous SHE is shown in Fig. 1(b). Similarly, an external spin current js ijpassing through a ferromagnet can in principle generate a charge current ~J. By the same arguments, the most general expression for~Jis Jk=2e ~\u0012ISH ijkjs ij (6) where\u0012ISH ijkis the inverse spin-Hall angle tensor of rank 3 that does not depend on spin current js ij. For a ferro- magnet whose magnetisation can also participant in the generalized ISHE, the most general \u0012ISH ijk, up to the linear\n3 term in~M, is \u0012ISH ijk=\u00120 0\u000fijk+\u00120 1Ml\u000filn\u000fjnk+\u00120 2Ml\u000fink\u000fjln; (7) \u00120 0is the usual inverse spin Hall angle that does not in- teract with ~M,\u00120 ( = 1;2) are coe\u000ecients that charac- terize the anomalous ISHEs linear in ~M. If the applied spin current is js 33, the conventional ISHE says no electric current can be generated. However, it is very di erent here, and one has, from Eqs. (6) and (7), Jk=~ 2e(\u00120 1+\u00120 2)\u000eki6=3Mijs 33: (8) In this case, the theory predicts that a charge current of~ 2e(\u00120 1+\u00120 2)js 33~M?is generated, where ~M?is projec- tion of magnetisation vector in the xy-plane. The charge current should be zero if the magnetisation is parallel to the spin current propagation direction. The schematic of this anomalous ISHE is shown is Fig. 2(a). If the applied spin current is js 12, then charge current from the ISHE of Eqs. (6) and (7) is Jk=~ 2ejs 12[\u00120 0\u000ek3+\u00120 1M2\u000ek1+\u00120 2M1\u000ek2]: (9) Interestingly, beside of charge current~ 2ejs 12\u00120 0^zalong the ^z-direction from conventional ISHE, there are two new charge currents~ 2ejs 12\u00120 1M2^xand~ 2ejs 12\u00120 2M1^yalong the ^x- and ^y-directions respectively. This two new anoma- lous ISHEs are illustrated in Figs. 2(c) and 2(d). No anomalous charge current is generated when ~Mis along thez-direction. Of course, the conventional ISHE can generate a charge current along the zdirection, and this charge current does not depend on ~M. The anomalous SHEs and ISHEs described above work also for the interconversion of charge-spin in an anti- ferromagnet involving the Neel order parameter ~ n. One needs simply to replace the magnetization ~Mby~ n. In fact, the theory can even be applied to ctitious order parameters such as topological insulators or 2D materi- als whose surface direction involve in many physical phe- nomenon. Indeed, there are already many evidences for the existence of charge-spin conversion beyond current paradigm of SHE. For example, the existence of anoma- lous SHE may have already observed in ferromagnet [22], in anti-ferromagnets [23{25] and in two-dimensional (2D) Weyl semimetals (a case of anomalous SHE involved c- titious order parameters of 2D materials) [26, 27]. Of course, it shall be interesting to test the predictions made here quantatively. Here we would like to propose one possible experimen- tal set-up for experimental veri cation of predictions de- scribed above. Figure 3 is the illustration of the set-up. A FM1/NM/FM2 multilayer system lays in the xy-plane, and a charge current ~Jis applied to the bottom ferromag- netic layer FM2 whose magnetization magnetization ~Mis collinear with ~J. NM is non-magnetic-spacing layer that (a) js 33(b) js 33M JM No change current (c) js 12 M J(d) js 12 M J xyzFIG. 2: Schematics of anomalous ISHE: (a) The ow of a spin current js 33(the thinner red arrowed line) generates a charge current along ~M?(the thicker red arrowed line), the projection of ~Min the xy-plane. The charge current ~J(the black arrowed line) is proportional to M?. (b) No charge current can be generated when ~Mis along the ^ z. (c-d) Charge currents (the black arrowed lines) proportional to the y(c) andx(d) components of the magnetization (the thicker red arrowed lines) are generated by the ow of a spin current js 12 (the red thinner lines). can be metal or thin insulating lm. The charge cur- rent direction is chosen as the x-direction. The charge current generate two spin currents js 33= (\u00121+\u00122)~ 2eMJ andjs 32=\u00120~ 2eJ(the black arrowed lines) propagating perpendicularly to the layers. One of them js 32is the charge current from the conventional SHE. The other js 33 is from the anomalous SHE. The two spin currents pass thought the spacing layer and enter into the top ferro- magnetic metal layer FM1. If magnetization ~M1in FM1 is along the z-direction,js 33generates no charge current from anomalous ISHE illustrated in Fig. 2b, as well as no current from the conventional ISHE because the propa- gation and polarisation of the current are collinear. Spin currentjs 32can generate two charge current in FM2. One of them~J1=\u00120 02e ~js 32is from the conventional ISHE, and is ow in the x-direction. The other ~J2=\u00120 22e ~M1js 32pro- portional to M1is from the anomalous ISHE that is ex- plained in Fig. 2d. For an open circuit in the y-direction on the top layer (FM1), it shall generate a voltage drop cross they-direction as denoted by Vyin Fig. 3.Vyshall\n4 xyz(a) js 33M J js 32 FM2 NM js 33M J js 32 FM2 NMJ1 M1J2FM1Vy M1FM1Vy (b) FIG. 3: (Color online) Illustration of an experimental set-up of FM1/NM/FM2 multilayer system lying in the xy-plane. FM2 is a ferromagnetic metal layer of magnetization ~M(the thinner red arrowed line) for spin current generation. Applied charge current ~J(the thicker red arrowed line) is collinear with ~Mand along the x-direction. NM is non-magnetic- spacing layer that can be either a metallic or a thin insulating lm. FM1 is another ferromagnetic metal for spin current de- tection whose magnetization ~M1is along the z-direction. Spin currents js 33andjs 32(the black arrowed lines decorated with smaller arrows) are generated by the anomalous ( js 33) and conventional SHE. The two spin currents passing thought the spacing layer and enter into the top ferromagnetic metal layer FM1. ~J1and~J2are two charge currents generated from the anomalous ISHE. A voltage drop Vyacross the ydirection in FM1 is generated. (a) A set-up for NM being a thin insulat- ing spacing. (b) For NM being a metal, FM1 is replaced by a Hall bar along the ydirection. change sign when ~M1reverses its direction. Both the existence of a non-zero Vyand its sign change are the features of the anomalous ISHE. Ideally, one would like to eliminate closed circuit in the x-direction on the top layer in order to eliminate possible contribution of usual anomalous Hall contribution to Vy. This can be achieved either by using a thin insulating spacing or by using a Hall bar as denoted by Fig. 3b. Obviously, the charge current along the y-direction is a uniquely feature of the anomalous ISHE predicted in this theory. Because all existing e ects do not result in a ~M2dependentVy. According to the anomalous SHE and ISHE described above, a charge current along the x-directions in a fer- romagnetic or anti-ferromagnetic metal, whose order pa- rameter is collinear with the current, can generate js yy andjs zz. Since the yandzdirection is open and no sus- tainable spin current exist, a spin accumulation of <sz> and<sy>will occur on the two surface respectively in thezandydirections. Thus this direction-dependent spin accumulation is another ngerprints of the present theory. Of course, this spin accumulation is hidden in the main order parameter pointing to the x-direction, and how to observe it may be an issue. It may be easier to observe the spin accumulation in an anti-ferromagnet because of zero net magnetization everywhere in the ab- sence of a current. Clearly, all three anomalous SHEs and ISHEs involvethe coupling between order parameters such as the mag- netization of ferromagnets or the Neel order of anti- ferromagnets. In terms of applications, this nice prop- erty allow one to manipulate the generated spin or charge currents by controlling the order parameter. So far, the predictions are based on the general principle of tensor transformation, instead of deriving these terms from a microscopic Hamiltonian. In some sense, similar to en- ergy spectrum analysis in group theory, our theory does not provide the actual possible strengths of the anoma- lous SHEs and ISHEs, \u00121,\u00120 1,\u00122, and\u00120 2. To nd these strengths, one needs to compute all possible spin (charge) current conversion from a given microscopic model when an external charge (spin) current is applied. Such a mi- croscopic theory is surely important and necessary al- though it is foreseeable di\u000ecult because of necessity of including electron-electron interactions. In conclusion, I predict the existence of anomalous SHEs and ISHEs in magnetic materials when the charge- spin interconversion involve the order parameters such as the magnetization in ferromagnetic materials and the Neel order in anti-ferromagnetic materials. In particu- lar, spin current js iican be generated by a charge cur- rent collinear with the order parameter and propagating perpendicularly to ^i. Inversely, a charge current can be generated by a spin current of js iialong the projection of order parameter perpendicular to ^i. Two anomalous spin currents proportional to the magnitude of order parame- ter can be generated by an applied charge current when it is perpendicular to the order parameter. One of them propagates along the order parameter and is polarized along the charge current direction. The other propagates along the charge current direction and is polarized along the order parameter. Its inverse e ect is the generation of two charge currents by a spin current of js ij6=i. One current proportional to the i'th component of the order parameter ow along the ^j-direction, and the other pro- portional to the j'th component of the order parameter ow along the ^i-direction. This work was supported by the National Natural Science Foundation of China (Grant No. 11774296 and 11974296) as well as Hong Kong RGC Grants No. 16301518 and No. 16301619. I thank Xuchong Hu for preparing the gures. \u0003Electronic address: phxwan@ust.hk [1] Luqiao Liu, Chi-Feng Pai, Y. Li, H. W. Tseng, D. C. Ralph, R. A. Buhrman, \\Spin-Torque Switching with the Giant Spin Hall E ect of Tantalum\", Science 336(6081), 555-558 (2012). [2] Y. Zhang, H. Y. Yuan, X. S. Wang, and X. R. Wang, \\Breaking the current density threshold in spin-orbit- torque magnetic random access memory\", Phys. Rev. B 97, 144416 (2018).\n5 [3] P. Yan, X. S. Wang, and X. R. Wang, \\All-magnonic spin-transfer torque and domain wall propagation\", Phys. Rev. Lett. 107, 177207 (2011). [4] X.S. Wang, P. Yan, Y. H. Shen, G.E.W. Bauer, and X.R. Wang, \\Domain wall propagation through spin wave emission\", Phys. Rev. Lett. 109, 167209 (2012). [5] B. Hu and X. R. Wang, \\Instability of Walker Propa- gating Domain Wall in Magnetic Nanowires\", Phys. Rev. Lett. 111, 027205 (2013). [6] Jiahao Han, Pengxiang Zhang, Justin T. Hou, Saima A. Siddiqui, and Luqiao Liu, \\Mutual control of coherent spin waves and magnetic domain walls in a magnonic device\", Science 366(6469), 1121-1125 (2019). [7] D. K. C. MacDonald and K. Sarginson, \\Galvanomag- netic e ects in conductors\", Repts. Progr. in Phys. 15, 249 (1952). [8] E. M. Conwell,\\Galvanomagnetic e ects in semiconduc- tors at high electric elds, Phys. Rev. 123, 454 (1961). [9] S. D. Ganichev, E. L. Ivchenko, V. V. Bel'kov, S. A. Tarasenko, M. Sollinger, D. Weiss, W. Wegscheider and W. Prettl, \\Spin-galvanic e ect\", Nature 417, 153 (2002). [10] The Quantum Hall E ect , edited by R. E. Prange and S. M. Girvin (Springer-Verlag, New York, 1990). [11] Emerson M. Pugh and Norman Rostoker, \\Hall e ect in ferromagnetic materials\", Rev. Mod. Phys. 25, 151 (1953). [12] M. I. Dyakonov and V. I. Perel, \\Possibility of orientating electron spins with current\". Sov. Phys. JETP Lett. 13, 467 (1971). [13] J. E. Hirsch, \\Spin Hall e ect\", Phys. Rev. Lett. 83, 1834 (1999). [14] Y. Kato; R. C. Myers; A. C. Gossard; D. D. Awschalom, \\Observation of the Spin Hall E ect in Semiconductors\". Science 306(5703), 1910-1913 (2004). [15] J. Wunderlich; B. Kaestner; J. Sinova; T. Jungwirth, \\Experimental Observation of the Spin-Hall E ect in a Two-Dimensional Spin-Orbit Coupled Semiconductor System\", Phys. Rev. Lett. 94(4), 047204 (2005). [16] E. Saitoh, M. Ueda, H. Miyajima and G. Tatara, \\Con- version of spin current into charge current at room tem- perature: inverse spin-Hall e ect\", Appl. Phys. Lett. 88, 182509 (2006). [17] T. Kimura, Y. Otani, T. Sato, S. Takahashi, and S. Maekawa, \\Room-temperature reversible spin Hall ef- fect\", Phys. Rev. Lett. 98, 156601 (2007).[18] Y. Kajiwara, K. Harii, S. Takahashi, J. Ohe, K. Uchida, M. Mizuguchi, H. Umezawa, H. Kawai, K. Ando, K. Takanashi, S. Maekawa and E. Saitoh, \\Transmission of electrical signals by spin-wave interconversion in a mag- netic insulator\", Nature 464, 262-267 (2010). [19] Y. Zhang, H. W. Zhang, and X. R. Wang, \\Extraordi- nary galvanomagnetic e ects in polycrystalline magnetic lms\", Europhys. Lett. 113, 47003 (2016). [20] Y. Zhang, X. S. Wang, H. Y. Yuan, S. S. Kang, H. W. Zhang, and X. R. Wang, \\Dynamic magnetic susceptibil- ity and electrical detection of ferromagnetic resonance\", J. Phys.: Condens. Matter 29, 095806 (2017). [21] Y. Zhang, Q. Liu, B. F. Miao, H. F. Ding, and X. R. Wang, \\Anatomy of electrical signals and dc-voltage line shape in spin-torque ferromagnetic resonance\", Phys. Rev. B. 99, 064424 (2019). [22] H. Kurebayashi, J. Sinova, D. Fang, A. C. Irvine, T. D. Skinner, J. Wunderlich, V. Novak, R. P. Campion, B. L. Gallagher, E. K. Vehstedt, L. P. Zarbo, K. Vyborny, A. J. Ferguson, and T. Jungwirth, \\An antidamping spin- orbit torque originating from the Berry curvature\", Nat. Nanotech. 9 , 211217 (2014). [23] M. Kimata, H. Chen, K. Kondou, S. Sugimoto, P. K. Muduli, M. Ikhlas, Y. Omori, T. Tomita, A. H. MacDon- ald, S. Nakatsuji, and Y. Otani, \\Magnetic and magnetic inverse spin Hall e ects in a non-collinear antiferromag- net\", Nature 565 , 627 (2019). [24] Y. Liu, Y. Liu, M. Chen, S. Srivastava, P. He, K. L. Teo, T. Phung, S-H. Yang, and H. Yang \"Current-induced out-of-plane spin accumulation on the (001) surface of the IrMn3 antiferromagnet\", Phys. Rev. Appl. 12 , 064046 (2019). [25] X. Chen, X. Zhou, R. Cheng, C. Song, J. Zhang, Y. Wu, Y. Ba, H. Li, Y. Sun, Y. You, Y. Zhao, and F. Pan, \\Electric eld control of Nel spin-orbit torque in an an- tiferromagnet\", Nat. Mater. 18 , 931 (2019). [26] D. MacNeill, G. M. Stiehl, M. H. D. Guimaraes, R. A. Buhrman, J. Park and D. C. Ralph, \"Con- trol of spin-orbit torques through crystal symmetry in WTe2/ferromagnet bilayers\", Nat. Phys. 13 , 300 (2017). [27] M. H. Guimaraes, G. M. Stiehl, D. MacNeill, N. D. Reynolds, and D. C. Ralph, \\Spin-orbit torques in NbSe2/permalloy bilayers\", Nano Lett. 18 , 13111316 (2018).\n",
  "metadata": {
    "paper_id": "2008.05303v1",
    "downloaded_at": "2025-08-29T17:40:34.612622+00:00"
  },
  "processed_at": "2025-08-29T17:40:34.612647+00:00"
}