{
  "content": "arXiv:2402.05807v1 [math.AG] 8 Feb 2024RIGID CURRENTS IN BIRATIONAL GEOMETRY VLADIMIR LAZI ´C AND ZHIXIN XIE Abstract. A rigid current on a compact complex manifold is a closed positive current whose cohomology class contains only one c losed posi- tive current. Rigid currents occur in complex dynamics, alg ebraic and diﬀerential geometry. The goals of the present paper are: (a ) to give a systematic treatment of rigid currents, (b) to demonstrat e how they appear within the Minimal Model Program, and (c) to give many new examples of rigid currents. Contents 1. Introduction 1 2. Preliminaries 3 3. Rigid currents 6 4. Rigid currents and ﬁbrations 9 5. Rigidity and currents with minimal singularities 11 6. Weak rigidity 14 7. Proofs of the main results 16 References 18 1.Introduction Rigid cohomology classes on a compact complex manifold Xare those which contain precisely one closed positive currents; such currents are then calledrigid currents . Rigid currents have occurred in diﬀerent contexts in complex dynamics, algebraic geometry and diﬀerential geome try: we review some of these in Section 3. Only recently have they been given a name in [SSV23], where they were investigated in the context of hyperk¨ ahl er mani- folds. There are several goals of the present paper. The ﬁrst is to gi ve a sys- tematic treatment of rigid currents, especially with respe ct to surjective Lazi´ c gratefully acknowledges support by the Deutsche For schungsgemeinschaft (DFG, German Research Foundation) – Project-ID 286237555 – TRR 19 5. We thank Tien-Cuong Dinh for explaining Proposition 5.2and for many useful comments, to Matei Toma for pointing out Example 3.7, and to Hsueh-Yung Lin and Thomas Peternell for valuable conversations on the topic of this paper. 2020Mathematics Subject Classiﬁcation : 14E30, 32U40, 32J25. Keywords : rigidcurrents, currentswithminimal singularities, Min imal Model Program. 1\n2 V. LAZI ´C AND Z. XIE morphisms. We also analyse in detail their relationship wit h currents with minimal singularities. The second goal is to demonstrate ho w they appear within the Minimal Model Program (MMP). And the third is to gi ve many new examples of rigid currents. To give some context, let ( X,∆) be a projective log canonical pair of dimensionn, andassumethatweknowtheexistenceofgoodminimalmodels in dimension n−1. The question that motivates us is the following: assume that we know that κι(X,KX+∆)≥0;1how can we conclude that ( X,∆) has a good minimal model? When κι(X,KX+∆)>0, then we now know that (X,∆) has a good minimal model by [ Laz24, Theorem 1.3], hence the main remaining case is when κι(X,KX+ ∆) = 0. In that case, if a good minimal model of ( X,∆) exists, then KX+ ∆ deﬁnes a rigid current by Lemma3.9, after pulling back to a resolution of X. Thus,a posteriori we know the rigidity of KX+∆.A priori, if one knew the rigidity of KX+∆, there is some evidence that this fact would be an important in gredient in a proof that ( X,∆) has a good minimal model. This deﬁnes the setup of our paper: if we are given a projectiv e log canonical pair ( X,∆) such that κι(X,KX+∆) = 0, we would like to show thatKX+∆ deﬁnes a rigid current after pulling back to a resolution o fX. We arenot yet ableto provethat inthis generality. However, we will show in this paper that each component of the correspondingeﬀective divisor deﬁnes a rigid current on a suﬃciently high resolution of X. The following are the main results of the paper. The ﬁrst deal s with pairs with klt singularities. Theorem 1.1. Assume the existence of good models for projective log canon - ical pairs in dimension n−1. Let(X,∆)be a projective klt pair of dimension nsuch thatκι(X,KX+ ∆) = 0, and letD≥0be the unique R-divisor such that KX+∆∼RD. Let f:Y→Xbe a log resolution of (X,∆+D). Then for each desingularisation π:Z→Xwhich factors through f, each component of π∗Ddeﬁnes a rigid current. When the pairs are log canonical, we can prove a similar resul t, albeit under somewhat stronger assumptions. Theorem 1.2. Assume the Nonvanishing conjecture in dimension nand the existence of good models for projective log canonical pa irs in dimension n−1. Let(X,∆)be a projective log canonical pair of dimension nsuch that κι(X,KX+∆) = 0 , and letD≥0be the unique R-divisor such that KX+ ∆∼RD. Letf:Y→Xbe a log resolution of (X,∆ +D). Then for each desingularisation π:Z→Xwhich factors through f, each component of π∗Ddeﬁnes a rigid current. 1Here,κιdenotes the invariant Iitaka dimension, see Section 2.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 3 In particular, in the notation of the theorems, for each comp onent Γ of π∗D, we have that Γ is the only eﬀective divisor numerically equivalent to Γ. This is a very special property of these components: indee d, as Example 3.8shows, there exist a smooth projective variety Zand a smooth prime divisorPonZsuch thatκ(Z,P) = 0, but there exists another eﬀective divisorP′numerically equivalent to P. However, note that the rigidity of currentsofintegration, asprovedinTheorems 1.1and1.2, isamuchstronger property than saying that the corresponding class contains only one current of integration of an eﬀective R-divisor, see Remark 5.3. 2.Preliminaries Throughout the paper we work over C, and all manifolds are connected. We writeD≥0 for an eﬀective R-divisorDon a normal variety X. A birational contraction is a birational map whose inverse does not contract any divisors. If f:X→Yis a surjective morphism of compact complex manifolds or of normal varieties, and if Dis anR-divisor on X, thenD isf-exceptional if codim Yf(SuppD)≥2. We use the convention that dc=1 2πi(∂−∂), so thatddc=i π∂∂. 2.1.Pairs.The standard reference for the deﬁnitions and basic results on the singularities of pairs and the Minimal Model Program is [ KM98]. Apair (X,∆) inthispaperalways hasaboundary∆whichisaneﬀective R-divisor. Many results on the existence of minimal models for log canon ical pairs are now known, see [ LT22]. 2.2.Minimal and good models. Let (X,∆) be a log canonical pair and letYbe a normal variety. A birational contraction f:X/axisshort/axisshort/arrowaxisrightYis aminimal model of (X,∆) ifKY+f∗∆ isR-Cartier and nef, and if there exists a resolution of indeterminacies ( p,q):W→X×Yof the map fsuch that p∗(KX+∆)∼Rq∗(KY+f∗∆)+E, whereE≥0 is aq-exceptional R-divisor which contains the whole q-exceptional locus in its support. If KY+f∗∆ is additionally semiample, them fis agood minimal model , or simply a good model, of (X,∆). 2.3.Invariant Iitaka dimension. We use the invariant Iitaka dimension of a pseudoeﬀective R-CartierR-divisorDon a normal projective variety X, denoted by κι(X,D). It shares many of the good properties with the Iitaka dimension for Q-divisors [ Fuj17, Section 2.5] that will be used in this paper without explicit mention. In particular, the invariant Iit aka dimension of a Q-divisor is the same as its usual Iitaka dimension by [ Fuj17, Proposition 2.5.9]. If the divisor Dhas rational coeﬃcients or if D≥0, its Iitaka dimension is denoted by κ(X,D). We need two properties which will be used without explicit me ntion, see [Laz24, Section 2]. First, if Dis anR-Cartier R-divisor on a normal pro- jective variety X, iff:Y→Xis a birational morphism from a normal\n4 V. LAZI ´C AND Z. XIE projective variety Y, and ifEis an eﬀective f-exceptional divisor on Y, then κι(X,D) =κι(Y,f∗D+E). Second, ifD1andD2are eﬀective R-Cartier R-divisors on a normal projec- tive variety Xsuch that Supp D1= SuppD2, thenκι(X,D1) =κι(X,D2). 2.4.Positive currents. IfXis a complex manifold, we denote its Bott- Chern (1,1)-cohomology space by H1,1 BC(X,C), and we denote by H1,1 BC(X,R) the space of its real points. If additionally Xis compact and K¨ ahler, then H1,1 BC(X,C) is isomorphic to the Dolbeault cohomology group H1,1(X,C). IfTis a closed (1 ,1)-current on a complex manifold X, we denote by {T}its class in H1,1 BC(X,C); ifTis real, then {T} ∈H1,1 BC(X,R). IfTis a representative of a class α∈H1,1 BC(X,C), we write T∈α; ifT′∈αis another representative, we also write T≡T′. A (1,1)-currentTonXispositive, and we write T≥0, ifT(ϕ) is a positive measure for every smooth ( n−1,n−1)-form of type ϕ= (iα1∧α1)∧...∧(iαn−1∧αn−1), whereαiare (1,0)-forms and n= dimX. A positive (1 ,1)-current is always real. IfTandT′are two (1,1)-currents on X, we writeT≥T′ifT−T′≥0. A cohomology class α∈H1,1(X,R) ispseudoeﬀective if it contains a closed positive current. IfDis an irreducible analytic subset of pure codimension 1 in X, then we denote by [ D] (or simply also by Dif there is no danger of confusion) the current of integration on the regular part of D, which is a positive closed (1,1)-current. If we have an R-divisorD=δ1D1+···+δrDronX, then we call the corresponding current [ D] :=δ1[D1]+···+δr[Dr] thecurrent of integration on D. Iff:Y→Xis a surjective holomorphic map between compact complex manifolds and if Tis a closed positive (1 ,1)-current on X, then one can easily deﬁne its pullback f∗TtoYsuch that {f∗T}=f∗{T}, see [Bou04, 2.2.3]. IfDis anR-divisor on X, thenf∗[D] = [f∗D]; this follows from the Lelong–Poincar´ e equation. If Gis anR-divisor on Y, thenf∗[G] = [f∗G], see for instance [ BM19, Proposition 4.2.78]. This will be relevant in Remark 4.3. 2.5.Plurisubharmonic functions. We refer to [ Dem12] for the deﬁnition and general properties of plurisubharmonic orpshfunctions on a complex manifoldX. Here we only collect several properties that we use often in this paper. For psh functions uandvon a complex manifold X, the functions u+v andmax{u,v}arealsopsh. Thepullbackof apshfunctionby aholomorphic map is again psh. A closed (1 ,1)-currentTonXis positive if and only if it can be written locally as T=ddcϕfor a psh function ϕ.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 5 Psh functions are locally bounded from above on X; if additionally Xis compact, then any psh function on Xis constant. A more suitable notion on compact complex manifolds is that of quasi-plurisubharmonic orquasi- pshfunctions. A function ϕ:X→[−∞,+∞) on a complex manifold X is quasi-psh if it is locally equal to the sum of a psh function and of a smooth function; equivalently, ϕis quasi-psh if it is integrable and upper semicontinuous, and there exists a smooth (1 ,1)-formθonXsuch that θ+ddcϕ≥0 in the sense of currents: then we say that ϕisθ-psh. Ifθis a smooth closed real (1 ,1)-form on Xand ifTis a closed positive (1,1)-current in {θ}, then there exists a locally integrable function ϕsuch thatT=θ+ddcϕ. In other words, ϕisθ-psh. IfXis additionally compact, thenϕis unique up to an additive constant. 2.6.Lelong numbers. We refer to [ Dem12] for the deﬁnition and general properties of Lelong numbers of psh functions on a complex manifold X. Here we recall several properties that we use often in this pa per. For psh functions uandvonXand for each point x∈Xwe have ν(u+v,x) =ν(u,x)+ν(v,x). IfTis a closed positive (1 ,1)-current, then locally around a point x∈Xwe can writeT=ddcϕfor a psh function ϕ, and we deﬁne the Lelong number ofTatxasν(T,x) :=ν(ϕ,x); this does not depend on the choice of ϕ. If Yis an analytic subset of Xand ifx∈X, then a result of Thie states that ν(Y,x) is equal to the multiplicity of Yatx. For a closed positive (1 ,1)- currentTand for any analytic subset YofXwe may deﬁne the generic Lelong number of TalongYas ν(T,Y) := inf x∈Yν(T,x), which is equal to ν(T,x) for a very general point x∈Yby a theorem of [Siu74]. IfTis a closed positive (1 ,1)-current on X, then by [ Siu74] there exist at most countably many codimension 1 analytic subsets Dksuch thatThas theSiu decomposition T=∑ ν(T,Dk)Dk+R, whereRis a closed positive (1 ,1)-current such that ν(R,Γ) = 0 for each codimension 1 analytic subset of X. In this paper we call∑textν(T,Dk)Dkthe divisorial part andRtheresidual part of (the Siu decomposition of) T. 2.7.Nakayama–Zariski functions and Boucksom–Zariski functions. LetXbe aQ-factorial projective variety and let Γ be a prime divisor on X. Nakayama [ Nak04] deﬁnedσΓ-functions on the pseudoeﬀective cone on X. Namely, ifDbe a big R-divisor on X, set σΓ(D) := inf{multΓ∆|0≤∆∼RD};\n6 V. LAZI ´C AND Z. XIE and ifDis a pseudoeﬀective R-divisor on X, we pick an ample R-divisorA onXand deﬁne σΓ(D) := lim ε↓0σΓ(D+εA); this does not dependon the choice of Aand is compatible with the deﬁnition above for big divisors. Moreover, σΓ(D) only dependson the numerical class ofD, henceσΓis well-deﬁned on the pseudoeﬀective cone of X. Nakayama originally deﬁnedthesefunctionswhen Xissmooth, butthedeﬁnitionworks well in the Q-factorial setting, see for instance [ LX23, Lemma 2.12]. IfXis a compact complex manifold and if Γ is an analytic prime div i- sor onX, Boucksom [ Bou04] deﬁnedν(·,Γ)-functions on the cone of pseu- doeﬀective classes in H1,1 BC(X,R), and he showed that they coincide with Nakayama’s σΓ-functions when one considers algebraic classes. To avoid possible confusion with Lelong numbers, we will denote thes e Boucksom’s functions also by σΓ. Here we sketch the construction when Xis a compact K¨ ahler manifold, which suﬃces for the purposes of this pape r. Letαbe a pseudoeﬀective class in H1,1(X,R). After ﬁxing a reference K¨ ahler form ω, and ifTmin,εis a current with minimal singularities in the class α+ε{ω}for a positive real number ε(see Section 5), set σΓ(α) := inf x∈Γsup ε>0ν(Tmin,ε,x); thisdoesnotdependonthechoice of ωandonehas σΓ(α) =ν(Tmin,Γ) when αis a big class and Tmin∈αis a current with minimal singularities. Even though the notation is slightly diﬀerent, it is easy to see tha t this deﬁnition is equivalent to that from [ Bou04]. Thefollowing easy lemma will becrucial in this paper, see [ Bou04, Propo- sition 3.6(i)] and the equation ( 3) below. Lemma 2.1. LetXbe a compact complex manifold and let Γbe an analytic prime divisor on X. Ifαis a pseudoeﬀective class in H1,1 BC(X,R), then σΓ(α)≤ν(T,Γ)for everyT∈α. The following well-known lemma relates σΓ-functions and the MMP; for the most general version, see for instance [ LX23, Lemma 2.14]. Lemma 2.2. Let(X,∆)be a projective Q-factorial log canonical pair and letΓbe a prime divisor such that σΓ(KX+∆) = 0 . Ifϕ: (X,∆)/axisshort/axisshort/arrowaxisright(Y,∆Y) is a minimal model of (X,∆), thenΓis not contracted by ϕ. 3.Rigid currents LetXbe a compact complex manifold. A class α∈H1,1 BC(X,R) isrigid if it contains exactly one closed positive (1 ,1)-current; thus, αis necessarily pseudoeﬀective. A closed positive (1 ,1)-currentTonXisrigidif its class {T} ∈H1,1 BC(X,R) is rigid. Another way of expressing this is as follows: following [ SSV23], for a pseudoeﬀective class α∈H1,1 BC(X,R) we denote Cα:={T∈α|T≥0}.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 7 Theαis rigid if Cαcontains exactly one element. This notation will be particularly useful in Section 4. Remark 3.1. LetXbe a compact complex manifold and let Tbe a rigid (1,1)-current on X. IfT′is a closed positive (1 ,1)-current on Xsuch that T′≤T, thenT′isalsorigid. Indeed,if S∈ {T′}wereanotherclosedpositive (1,1)-current, then S+(T−T′) would be a closed positive (1 ,1)-current in {T}diﬀerent than T. Rigid currents have appeared in diﬀerent contexts in the lite rature, but it seems they were ﬁrst deﬁned explicitly in the recent paper [SSV23]. We review next some of the examples of rigid currents in diﬀerent contexts. Example 3.2. LetXbea compact complex manifold. Thentheclass {0} ∈ H1,1 BC(X,R) is rigid: this is the ﬁrst and basic, but fundamental exampl e of rigidity of currents. Indeed, if T∈ C{0}, then there exists a distribution ϕ onXsuch thatT=ddcϕ. AsT≥0, we may identify ϕwith a psh function onX. By compactness, ϕmust be constant, hence T= 0, as desired. Example 3.3. Letπ:Y→Xbe a birational morphism between complex projective manifolds and let Ebe an eﬀective π-exceptional R-divisor on Y. ThenEis rigid. We will show a more general result in Corollary 4.4below. Example 3.4. One of the earliest examples of rigid currents occurred in complex dynamics [ Can01]. We refer to [ SSV23] for details, here we only recall the following special case of an important result fro m [DS10]: consider an automorphism f:X→Xof a compact K¨ ahler manifold, and let d1(f) be the spectral radius of f∗:H1,1(X,R)→H1,1(X,R). Then we know that d1(f)≥1 in general. If, however, d1(f)>1, then it follows from [ DS10, Corollary 4.3.2] that there exists a non-zero closed positi ve (1,1)-currentT onXsuch thatf∗T=d1(f)T, and each such current Tis rigid. Example 3.5. IfXis a K3 surface, then a nef class α∈H1,1(X,R) is parabolic ifα2= 0. Then [ FT23, Theorem 4.3.1] shows that each irrational parabolic class on a projective Xis rigid, if the Picard rank of Xis at least 3 andXhas no (−2)-curves. This was then extended in [ SSV23, Theorem 2.1] to hyperk¨ ahler manifolds Xwithb2(X)≥7 (all currently known classes of hyperk¨ ahler manifolds satisfy this condition) and para bolic currents on X, i.e. nef classes α∈H1,1(X,R) withαdimX= 0, which satisfy some additional irrationality properties. Example 3.6. An important non-dynamical early example of rigid currents appears in [ DPS94, Example 1.7]. Let Ebe an elliptic curve and let Ebe a vector bundle given by the extension corresponding to a nont rivial element in Ext1(OE,OE)≃H1(E,OE)≃C. Letσ:E→P(E) be the section of the projection P(E)→Ecorresponding to the quotient E → O E, and set C:=σ(E). ThenCis a nef divisor on P(E) which is rigid as a current. In particular, this gives an example of a nef line bundle which i s not hermitian semipositive.\n8 V. LAZI ´C AND Z. XIE Example 3.7. An interesting example of a rigid current on a compact non- K¨ ahlersurfaceisgivenin[ Tom08]. AnEnokisurface Xisaminimalcompact non-K¨ ahler surface which has a unique cycle Cof rational curves on it in the sense of [ Tom08, Deﬁnition 5], and the image of the class γ:={[C]} under the canonical morphism π:H1,1 BC(X,R)→H2 dR(X,R) is zero. Then [Tom08, Theorem 10(b)] shows that [ C] is the only closed positive d-exact (1,1)-current on Xup to a multiplicative constant. If now T∈γ, thenT isd-exact since π(γ) = 0, hence there exists c∈Rsuch thatT=c[C]. As thenc[C]≡[C], we conclude that c= 1 by Example 3.2, and therefore [ C] is a rigid (1 ,1)-current on X. Example 3.8. The following example is [ Leh13, Example 6.1], which we reproduce with more details. As mentioned in the introducti on, this is a possibly surprising example of a current which is not rigid: there exists a smooth projective threefold Zand distinct eﬀective divisors PandP′on Zsuch thatPis a smooth prime divisor, κ(Z,P) = 0,κ(Z,P′) = 1 and P≡P′. In particular, the class {P}is not rigid. Fix an elliptic curve Eand letS:=E×Ewith the projection morphisms p1andp2. LetF=p∗ 1F′andN:=p∗ 2N′, whereF′is a point on EandN′ is a degree-zero non-torsion divisor on E. We ﬁrst claim that for all f∈Z andn∈Z\\{0}we have κ(S,fF+nN) =−∞. (1) Indeed, assume that there exist integers fandn/\\e}atio\\slash= 0 and an eﬀective Q- divisorGonSsuch thatG∼QfF+nN, and letF1be a ﬁbre of p1which is not contained in the support of G+F. Then 0≤κ(F1,G|F1) =κ(F1,nN|F1) =κ(E,nN′) =−∞, a contradiction which shows ( 1). Now, set E:=OS⊕ OS(F+N) andZ:=P(E) with the projection morphismπ:Z→S. Letσ:S→Xbe the section of πcorresponding to the quotient E։OS(F+N), and setP:=σ(S). ThenPis a smooth prime divisor onXand it is well-known that OX(P)≃ OX(1), see for instance the proof of [ Har77, Proposition V.2.6]. Thus, by ( 1), for anym≥1 we have h0( Z,OZ(mP)) =h0( S,SymmE) =m∑ k=0h0( S,OS(k(F+N))) = 1, henceκ(Z,P) = 0. Deﬁne P1:=P−π∗N; then clearly P≡P1and by (1), for anym≥1 we have h0( Z,OZ(mP1)) =h0( S,SymmE ⊗OS(−mN)) =m∑ k=0h0( S,OS(kF+(k−m)N)) =h0( S,OS(mF)) . Therefore,κ(Z,P1) =κ(Z,F) = 1 andh0(Z,OZ(P1))>0, and we choose P′to be any eﬀective divisor such that P′∼P1.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 9 An important example of rigid currents in the context of this paper comes from the MMP. Lemma 3.9. Let(X,∆)be a projective log canonical pair which has a good model and such that κι(X,KX+∆) = 0 . Then for each birational morphism π:Y→Xsuch thatYis smooth, the class {π∗(KX+∆)}is rigid. Proof.Fix a birational morphism π:Y→Xsuch thatYis smooth. Let ϕ: (X,∆)/axisshort/axisshort/arrowaxisright(X′,∆′) be a birational contraction to a good model ( X′,∆′) of (X,∆), and let ( p,q):W→X×X′be a smooth resolution of indeter- minacies of ϕ; we may assume that pfactors through πand letf:W→Y be the induced map. Then by the Negativity lemma [ KM98, Lemma 3.39] there exists an eﬀective q-exceptional R-divisorEonWsuch that p∗(KX+∆)∼Rq∗(KX′+∆′)+E. (2) Sinceκι(X′,KX′+∆′) = 0 andKX′+∆′is semiample, we have KX′+∆′∼R 0, andhence {p∗(KX+∆)}={E}by (2). Therefore, theclass {p∗(KX+∆)} is rigid by Example 3.3. Sincep∗(KX+∆) =f∗π∗(KX+∆), we conclude by Corollary 4.2below. /square 4.Rigid currents and fibrations The following result was proved in [ Bou02, Proposition 1.2.7], and we include the proof for the beneﬁt of the reader. Proposition 4.1. Letf:X→Ybe a surjective morphism with connected ﬁbres between compact complex manifolds, and let α∈H1,1 BC(Y,R)be a pseu- doeﬀective class. Then the pullback map f∗:Cα→ Cf∗α is bijective. Proof.LetC⊆Ybe the set of critical values of f, and setY′:=Y\\Cand X′:=f−1(Y′). Then the map f|X′:X′→Y′is a holomorphic submersion. We proceed in two steps. Step 1.In this step we show that the map f∗is surjective. Fix a smooth form θ∈α. IfT∈ Cf∗α, then there exists a quasi-psh functionϕonXsuch thatT=f∗θ+ddcϕ. We ﬁrst claim that the function ϕ|f−1(y)is constant for every y∈Y. Indeed, ﬁx an open subset U⊆Ysuch that there exists a psh function u onUcontaining the point ywithθ|U=ddcu. ThenT|f−1(U)=ddc(f∗u+ ϕ|f−1(U)), hence the function f∗u+ϕ|f−1(U)is psh onf−1(U). Sincef−1(y) is compact, f∗u+ϕ|f−1(U)must be constant on f−1(y). Asf∗uis constant onf−1(y), the claim follows. For eachy∈Y′set ψ(y) :=ϕ(x) for some x∈f−1(y);\n10 V. LAZI ´C AND Z. XIE this is well deﬁned by the claim above. We next claim that ψis aθ|Y′-psh function on Y′. Indeed, for each y∈Y′ﬁx an open subset y∈U⊆Y′such that there exists a psh function uonUwithθ|U=ddcu. By shrinking Uif necessaryandbytheconstant ranktheoremwemay assumethat thereexists an open subset F⊆f−1(y) and local coordinates ( z1,...,zn) on an open subsetV⊆f−1(U) inXsuch thatV≃U×Fand in those coordinates, the mapf|Vis just the projection ( z1,...,zn)/mapsto→(z1,...,zm), wheren= dimX andm= dimY. Then for each point x∈F, the setU× {x}, viewed as a subset of V, is isomorphic to Uand the function ( u+ψ)|Ucorresponds to (f∗u+ϕ)|U×{x}under that isomorphism, by the deﬁnition of ψ. Since (f∗u+ϕ)|U×{x}is a psh function as in the previous paragraph, the function (u+ψ)|Uis also psh. This gives the claim. Therefore,ψis aθ|Y′-psh function on Y′, and it is clearly bounded from above near C, sinceϕis bounded from above on the whole X, asXis com- pact. Therefore, ψextends uniquely to a θ-psh function on Xby [Dem12, Theorem I.5.24], which we also denote by ψ. SetS:=θ+ddcψ; this is then a positive (1 ,1)-current on Y. SinceTandf∗Scoincide on X′, they must coincide on the whole Xagain by [ Dem12, Theorem I.5.24], and the surjectivity of f∗is proved. Step 2.In this step we show that the map f∗is injective. Assume we have two currents T1andT2inCαsuch thatf∗T1=f∗T2, and ﬁx a smooth form θ∈α. Then there exist quasi-psh functions ψ1and ψ2onYsuch thatT1=θ+ddcψ1andT2=θ+ddcψ2. Consequently, we have ddcf∗(ψ1−ψ2) = 0. Then as in the last two paragraphs of Step 1 this implies that t he functions ψ1−ψ2andψ2−ψ1are psh on Y, henceddcψ1=ddcψ2. This shows that T1=T2, which was to be proved. /square An immediate corollary is the following. Corollary 4.2. Letπ:Y→Xbe a surjective morphism with connected ﬁbres between compact complex manifolds and let α∈H1,1 BC(X,R)be a pseu- doeﬀective class. Then αis rigid if and only if π∗αis rigid. Remark 4.3. Ifπ:Y→Xis a surjective morphism between compact complex manifolds and if α∈H1,1 BC(Y,R) is a rigid class, it is in general not true thatπ∗αis rigid, even if πis bimeromorphic. Indeed, let X=P1×P1 and ﬁx a ﬁbre G⊆Xof the ﬁrst projection to P1. ThenGis clearly not rigid asκ(X,G) = 1. Now consider the blowup π:Y→XofXat a point contained in G. Then as (π∗G)2= 0, we easily calculate that π∗Gis the sum of two (−1)-curves, and let G′be the strict transform of GonY. SinceG′ can be contracted to a smooth projective surface by Castelnu ovo’s criterion, it is rigid by Example 3.3, butG=π∗G′is not. We have the following generalisation of Example 3.3.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 11 Corollary 4.4. Letπ:Y→Xbe a surjective morphism with connected ﬁbres between complex projective manifolds, let Dbe a pseudoeﬀective R- divisor onXand letEbe an eﬀective π-exceptional R-divisor on Y. Then the map f:C{D}→ C{π∗D+E}, T/mapsto→π∗T+E is an isomorphism. In particular, {D}is rigid if and only if {π∗D+E}is rigid. Proof.AssumeS1andS2are two currents in {D}such thatf(S1) =f(S2). Thenπ∗S1=π∗S2, and thusS1=S2by Proposition 4.1. This shows that fis injective. To showthesurjectivity of f, letT∈ C{π∗D+E}. Thenfor each component Γ ofEwe have ν(T,Γ)≥σΓ(π∗D+E)≥multΓE by Lemma 2.1and by [ Nak04, Proposition III.5.7 and Lemma III.5.14]. Consequently, the current T−E∈ {π∗D}is positive by considering the Siu decomposition of T, hence by Proposition 4.1there exists S∈ C{D}such thatT−E=π∗S. Therefore, we have T=f(S), as desired. /square Remark 4.5. It is reasonable to expect that Corollary 4.4holds also when Dis a closed positive (1 ,1)-current, but the proof of surjectivity above uses [Nak04] crucially, which works only in the setting of algebraic cla sses. 5.Rigidity and currents with minimal singularities A good reference for currents with minimal singularities is [Bou04]. Here we recall some of the properties we need in this paper. Let ϕ1andϕ2be quasi-pshfunctions on a compact complex manifold X. Then we say that ϕ1 isless singular thanϕ2, and write ϕ1/pre⌋edesequalϕ2, if there exists a constant Csuch thatϕ2≤ϕ1+C. We denote by ϕ1≈ϕ2the induced equivalence relation, i.e. we say that ϕ1andϕ2haveequivalent singularities ifϕ1/pre⌋edesequalϕ2/pre⌋edesequalϕ1. LetT1andT2be two closed positive (1 ,1)-currents on Xin a ﬁxed pseu- doeﬀective class α∈H1,1 BC(X,R) and letθ∈αbe a ﬁxed smooth form. Then there exist θ-psh functions ϕ1andϕ2such thatT1=θ+ddcϕ1and T2=θ+ddcϕ2. We say that T1isless singular thanT2, and write T1/pre⌋edesequalT2, ifϕ1/pre⌋edesequalϕ2; and similarly for T1≈T2. This does not depend on the choice ofθ,ϕ1andϕ2. Any two closed positive (1 ,1)-currents with equivalent singularities have the same Lelong numbers. A compactness argument on the set of θ-psh functions then shows that there exists a currents Tmin∈αsuch thatTmin/pre⌋edesequalTfor allT∈α. We callTminapositive current with minimal singularities in α. For each point x∈Xwe have ν(Tmin,x) = inf T∈αν(T,x). (3) Part (a) of the following result shows that the relation /pre⌋edesequalis compati- ble with pullbacks. Part (b), which is [ BEGZ10 , Proposition 1.12], is the consequence of (a) and of Proposition 4.1.\n12 V. LAZI ´C AND Z. XIE Proposition 5.1. Letf:Y→Xbe a surjective morphism with connected ﬁbres between compact complex manifolds and let α∈H1,1 BC(X,R)be a pseu- doeﬀective class. (a)LetT1andT2be two(1,1)-currents in Cα. ThenT1/pre⌋edesequalT2if and only if f∗T1/pre⌋edesequalf∗T2. (b)LetT∈ Cα. ThenThas minimal singularities if and only if the current f∗T∈ Cf∗αhas minimal singularities. Proof.We ﬁrstshow (a). Fix asmooth (1 ,1)-formθ∈αandθ-pshfunctions ϕ1andϕ2onXsuchthatT1=θ+ddcϕ1andT2=θ+ddcϕ2. IfT1/pre⌋edesequalT2, then there exists a constant C1such thatϕ1≥ϕ2+C1, hencef∗ϕ1≥f∗ϕ2+C1. Therefore, f∗T1/pre⌋edesequalf∗T2. Conversely, if f∗T1/pre⌋edesequalf∗T2, then there exists a constantC2such thatf∗ϕ1≥f∗ϕ2+C2, henceϕ1≥ϕ2+C2asfis surjective. Thus, T1/pre⌋edesequalT2. We now show (b). Assume that Thas minimal singularities and let SY∈ Cf∗α. By Proposition 4.1there exists a (1 ,1)-currentSX∈ Cαsuch thatSY=f∗SX. ThenT/pre⌋edesequalSX, hencef∗T/pre⌋edesequalf∗SX=SYby (a), and con- sequentlyf∗Thas minimal singularities. Conversely, assume that f∗Thas minimal singularities and let SX∈ Cα. Thenf∗T/pre⌋edesequalf∗SX, henceT/pre⌋edesequalSX by (a), and consequently Thas minimal singularities. /square Note that a current with minimal singularities in a pseudoeﬀe ctive class is unique up to equivalence of singularities, but is in gener al far from being unique. The following result was shown to us by Tien-Cuong Di nh, and we are grateful to him for allowing us to include it here. Proposition 5.2. LetXbe a compact complex manifold and let αbe a pseu- doeﬀective class in H1,1 BC(X,R). Ifαis not rigid, then there exist inﬁnitely many currents with minimal singularities in α. Proof.LetTbe a current with minimal singularities in α. Sinceαis not rigid, there exists another closed positive current S∈α. We may assume thatSis not a current with minimal singularities in α, since otherwise for eacht∈[0,1] the current tT+(1−t)S∈αhas minimal singularities, and the result follows. If we ﬁx a smooth (1 ,1)-formθ∈α, then there exist quasi-psh functions ϕandψonXsuch that T=θ+ddcϕandS=θ+ddcψ. For each real number cset ϕc:= max{ϕ,c+ψ}andTc:=θ+ddcϕc. Sinceϕandc+ψareθ-psh, then so is ϕc, and hence the closed (1 ,1)-current Tcis positive and clearly Tc∈α. Asϕ≤ϕc, we haveTc/pre⌋edesequalT, henceTcis also a current with minimal singularities in α, for eachc. SinceXis compact, ϕandψare bounded from above, and we ﬁx a con- stantc≫0 such that ϕc/\\e}atio\\slash=ϕ. Assume that Tc=T. Then by compactness\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 13 ofXthere exists a constant Csuch thatϕc=ϕ+C. The choice of cimplies thatϕc(x)> ϕ(x) for somex∈X, henceC >0 and consequently ϕc> ϕ everywhere on X. Therefore, ϕc=c+ψby the deﬁnition of ϕc, and thusψ has minimal singularities. This contradicts the assumptio n on the current Smade in the ﬁrst paragraph of the proof. Therefore, Tc/\\e}atio\\slash=T, and we conclude as in the ﬁrst paragraph. /square Remark 5.3. LetXbe a compact complex manifold and let αbe a pseu- doeﬀective class in H1,1 BC(X,R). Consider the set |α|≡:={[D]∈α|D≥0 is anR-divisor}. Then clearly |α|≡⊆ Cα. Ifαis not rigid, then the set Cαis actually much bigger than |α|≡. We can see this as follows. By Proposition 5.2there are inﬁnitely many currents with minimal singularities in α. However, at most one of them belongs to |α|≡: indeed, assume that there exist two distinct eﬀective R-divisorsD1andD2such that both [ D1] and [D2] are currents with minimal singularities in Cα. Then there exists a prime divisor Γ on X such that mult ΓD1/\\e}atio\\slash= mult ΓD2. But then ν(D1,Γ)/\\e}atio\\slash=ν(D2,Γ) by Thie’s theorem, which contradicts ( 3). The following lemma is crucial in this paper and it connects n on-rigidity with properties of currents with minimal singularities. Lemma 5.4. LetXbe a compact complex manifold and let G≥0be an R-divisor on Xsuch that the class {G}is not rigid. Let Gminbe a current with minimal singularities in {G}. Then: (a)for each component ΓofGwe haveν(Gmin,Γ)≤multΓG, (b)there exists a component ΓofGsuch thatν(Gmin,Γ) = 0. Proof.Part (a) follows immediately from the deﬁnition of currents with minimal singularities. For the remainder of the proof we show (b). Let Gmin=R+D (4) be the Siu decomposition of Gmin. By (a) we know that D≤G, (5) and we ﬁrst claim that D/\\e}atio\\slash=G. (6) Indeed, assumethat D=G. Pick anyT∈ C{G}, and letDTbethe divisorial part of the Siu decomposition of T. By construction and by ( 3) we have T≥DT≥D=G, and sinceT≡Gby assumption, we have that T−Gis a closed positive (1,1)-current such that T−G≡0. ThusT−G= 0 by Example 3.2, hence {G}is a rigid current, a contradiction which shows ( 6).\n14 V. LAZI ´C AND Z. XIE By (5) we may write G=r∑ i=1γiΓiandD=r∑ i=1δiΓi withγi>0 andγi≥δi≥0. Thus, since Gmin≡G, by (4) we have R≡r∑ i=1(γi−δi)Γi, (7) where clearly 0≤γi−δi≤γifor alli= 1,...,r. (8) Moreover, by ( 6) there exists an index 1 ≤j≤rsuch thatγj−δj>0. This and (8) show that k:= max{t∈R|t(γi−δi)≤γifor alli= 1,...,r} is a well-deﬁned positive real number. Without loss of gener ality, we may assume that k(γ1−δ1) =γ1. (9) Set Θ :=kR+r∑ i=1( γi−k(γi−δi)) Γi. Then Θ is the sum of two positive closed (1 ,1)-currents, hence is itself a closed positive (1 ,1)-current. We have ν(Θ,Γ1) =kν(R,Γ1)+( γ1−k(γ1−δ1)) = 0 (10) by (9). Moreover, by ( 7) we have Θ≡kr∑ i=1(γi−δi)Γi+r∑ i=1( γi−k(γi−δi)) Γi=G, thus Θ∈ {G}. By (3) and (10) this implies 0≤ν(Gmin,Γ1)≤ν(Θ,Γ1) = 0, which yields the result. /square 6.Weak rigidity In this section we introduce a weaker rigidity property allu ded to in The- orems1.1and1.2. Deﬁnition 6.1. LetXbe a compact complex manifold and let Γ ≥0 be anR-divisor on X. We say that {Γ}isweakly rigid if the class of each component of Γ is rigid.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 15 Remark 6.2. LetXbe a compact complex manifold and let G≥0 be an R-divisor on X. If{G}is rigid, then it is weakly rigid by Remark 3.1. The converse is, however, not true in general. Indeed, consider the birational map as in Remark 4.3. Then each component of π∗Gcan be contracted to a smooth projective surface by Castelnuovo’s criterion, hen ce{π∗G}is weakly rigid by Example 3.3. But by Corollary 4.2,{π∗G}is not rigid as {G}is not rigid. We have the following easy consequence of Corollary 4.2. Corollary 6.3. Letπ:Y→Xbe a surjective morphism with connected ﬁbres between compact complex manifolds and let Gbe an eﬀective R-divisor onX. If{G}is weakly rigid, then {π∗G}is weakly rigid. Proof.Assume that {G}is weakly rigid. If we write G=∑textk i=1γiΓias a sum of its components, then all classes {Γi}are rigid. By Corollary 4.2, each class {π∗Γi}is rigid, hence weakly rigid by Remark 6.2. Therefore, the class{π∗G}=∑textk i=1γi{π∗Γi}is weakly rigid. /square Remark 6.4. The converse of Corollary 6.3is not true in general. Indeed, with notation as in Remark 6.2, the class {π∗G}is weakly rigid, but {G}is not rigid, hence not weakly rigid by Remark 6.2. Example 6.5. LetDbe an eﬀective R-divisor on a complex projective surfaceS. Then there always exists a birational morphism f:S′→S such that {f∗D}is weakly rigid. Indeed, by passing to a resolution we may assume that Sis smooth. If Γ is a prime divisor on S, and if Γ′is the strict transform of Γ on the blowup of Sat a point lying on Γ, then (Γ′)2= Γ2−1. Therefore, if fis obtained by blowing up suﬃciently many pointson thecomponents of D, thenwemay assumethat each component of f∗Dhas negative self-intersection. Then the statement follow s from [Bou04, Proposition 3.13 and Theorem 4.5]. The following lemma will be crucial in the proofs of Theorems 1.1and 1.2. Lemma 6.6. LetXbe a compact complex manifold and let G≥0be an R-divisor on X. Assume that the class {G}is not weakly rigid and let Γbe an irreducible component of Gsuch that {Γ}is not rigid. Let Gmin∈ {G} andΓmin∈ {Γ}be currents with minimal singularities. Then ν(Γmin,Γ) = 0 andν(Gmin,Γ) = 0. Proof.Since{Γ}is not rigid, we have ν(Γmin,Γ) = 0 by Lemma 5.4. For the other statement, we may write G=γΓ+G′, whereγ >0 andG′is an eﬀective R-divisor on Xsuch that Γ is not a component of G′. Note that γΓmin+G′∈ {G}, and thus, by the deﬁnition\n16 V. LAZI ´C AND Z. XIE of currents with minimal singularities, we have 0≤ν(Gmin,Γ)≤ν(γΓmin+G′,Γ) =γν(Γmin,Γ)+ν(G′,Γ) = 0, which ﬁnishes the proof. /square 7.Proofs of the main results Finally, in this section we prove the main results of the pape r. Proof of Theorem 1.1. Step 1a. We may write KY+∆Y∼Rf∗(KX+∆)+E∼Rf∗D+E, whereE≥0 is anf-exceptional R-divisor having no common components with ∆ Y. Then by Corollary 6.3it suﬃces to show that the class {f∗D}is weakly rigid, hence it suﬃces to show that {f∗D+E}is weakly rigid. By replacing ( X,∆) by (Y,∆Y) andDbyf∗D+E, we may assume from the start that the pair ( X,∆ +D) is log smooth. We will show that the class{D}is weakly rigid. Step 1b. Fix 0<ε≪1 such that the pair ( X,∆+εD) is klt. Then KX+∆+εD∼R(1+ε)D. By replacing ( X,∆) by (X,∆ +εD) andDby (1 +ε)D, we may assume from the start that SuppD⊆Supp∆. (11) Step 1c. Let ∆′′be aQ-divisor such that ∆′′≥∆ and the pair ( X,∆′′) is klt. Then KX+∆′′∼RD+(∆′′−∆). (12) Ifκ(X,KX+∆′′)>0, then (X,∆′′) has a good model by [ Laz24, Theorem 1.3], hence ( X,∆) has a good model by [ Laz24, Theorem 1.4(b)], in which case we conclude by Lemma 3.9and by Remark 6.2. Therefore, we may assume that κ(X,KX+∆′′) = 0. Then there exists a Q-divisorD′′≥0 such that KX+∆′′∼QD′′. By [Laz24, Lemma 2.5(b)], this and ( 12) imply that D′′=D+ (∆′′−∆). Hence, it suﬃces to show that the divisor D′′is weakly rigid. By replacing ( X,∆) by (X,∆′′) andD byD′′, we may assume from the start that ∆ andDareQ-divisors and κ(X,KX+∆) = 0. (13) Step 2.Suppose by contradiction that the class {D}is not weakly rigid, and let Γ be a component of Dsuch that {Γ}is not rigid. Then Γ is a component of ∆ by ( 11), hence we may write ∆ =γΓ+∆′,\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 17 where Γ is not a component of ∆′and 0<γ <1. SetD′:=D+(1−γ)Γ, and observe that D′is not weakly rigid and KX+Γ+∆′∼QD′. (14) The pair (X,Γ+∆′) is plt, and by ( 11) we have Γ⊆SuppD′⊆Supp(Γ+∆′). (15) Moreover, since Supp D′= SuppD, by [DL15, Lemma 2.9] and by ( 13) and (14) we have κ(X,KX+Γ+∆′) = 0. (16) LetDmin∈ {D}and Γmin∈ {Γ}be currents with minimal singularities. Note thatDmin+(1−γ)Γmin∈ {KX+Γ+∆′}by (14), and thus, by Lemma 6.6we have 0≤ν( Dmin+(1−γ)Γmin,Γ) =ν(Dmin,Γ)+(1−γ)ν(Γmin,Γ) = 0. Therefore, by Lemma 2.1we infer σΓ(KX+Γ+∆′) = 0. (17) Step 3.From (16) we deduce that, in particular, the pair ( X,Γ+∆′) has an NQC weak Zariski decomposition, see [ LT22,§2.3]. Therefore, by our assumption in dimension n−1 and by [ LT22, Theorem F] we may run a (KX+Γ+∆′)-MMP which terminates with a minimal model ( Z,ΓZ+∆′ Z), where Γ Zand ∆′ Zare the strict transforms of Γ and ∆′, respectively. By (17) and by Lemma 2.2we have that Γ Z/\\e}atio\\slash= 0. Note that the pair (Z,ΓZ+∆′ Z) is plt, and we have κ(Z,KZ+ΓZ+∆′ Z) = 0 (18) by (16). LetD′ Zbe the strict transform of D′onZ. Then (14) gives KZ+ΓZ+∆′ Z∼QD′ Z, (19) and by (15) we have ΓZ⊆SuppD′ Z⊆Supp(Γ Z+∆′ Z). (20) Our assumption in dimension n−1 implies the Nonvanishing conjecture in dimensionn−1, henceby[ DHP13, Corollary 1.8] weobtainthat Γ Zdoesnot belong to the stable base locus of KZ+ΓZ+∆′ Z, which is equal to Supp D′ Z by (18) and (19). This contradicts ( 20) and concludes the proof. /square Proof of Theorem 1.2.As in Step 1a of the proof of Theorem 1.1, we may assumethat thepair ( X,∆+D) is log smooth. Inparticular, thepair ( X,∆) is then dlt. We need to show that the class {D}is weakly rigid. If theR-divisorKX+∆−ε⌊∆⌋is not pseudoeﬀective for each positive real number ε, then the pair ( X,∆) has a good model by [ Laz23, Theorem 3.1(a)], and thus Dis even rigid by Lemma 3.9.\n18 V. LAZI ´C AND Z. XIE Thus, we may assume that there exists δ′>0 such that the R-divisor KX+ ∆−δ′⌊∆⌋is pseudoeﬀective. Since we assume the Nonvanishing conjecture in dimension n, there exists an eﬀective R-divisorDδ′such that KX+∆−δ′⌊∆⌋ ∼RDδ′. Pick a real number 0 <δ<δ′. Then KX+∆−δ⌊∆⌋ ∼RDδ′+(δ′−δ)⌊∆⌋ (21) and KX+∆∼RDδ′+δ′⌊∆⌋. (22) Sinceκι(X,KX+∆) = 0 and KX+∆∼RD, this together with ( 22) implies by [Laz24, Lemma 2.5(b)] that D=Dδ′+δ′⌊∆⌋. This, in particular, yields SuppD= Supp(Dδ′+(δ′−δ)⌊∆⌋), (23) hence κι(X,KX+∆−δ⌊∆⌋) = 0 by (21) and by [ Laz24, Remark 2.4(b)]. Since the pair ( X,∆−δ⌊∆⌋) is klt, we conclude that the class of the R-divisorDδ′+(δ′−δ)⌊∆⌋is weakly rigid by (21) and by Theorem 1.1. Therefore, the class {D}is weakly rigid by (23). /square References [BEGZ10] S. Boucksom, P. Eyssidieux, V. Guedj, and A. Zeriah i,Monge-Amp` ere equa- tions in big cohomology classes , Acta Math. 205(2010), no. 2, 199–262. [BM19] D. Barlet and J. Magn´ usson, Complex analytic cycles I , Grundlehren der math- ematischen Wissenschaften, vol. 356, Springer, Cham; Soci ´ et´ e Math´ ematique de France, Paris, 2019. [Bou02] S. Boucksom, Cˆ ones positifs des vari´ et´ es complexes compactes , PhD Thesis, Universit´ e Joseph Fourier Grenoble, 2002, ava ilable at https://theses.hal.science/tel-00002268 . [Bou04] ,Divisorial Zariski decompositions on compact complex manif olds, Ann. Sci.´Ecole Norm. Sup. (4) 37(2004), no. 1, 45–76. [Can01] S. Cantat, Dynamique des automorphismes des surfaces K3, Acta Math. 187 (2001), no. 1, 1–57. [Dem12] J.-P. Demailly, Complex Analytic and Diﬀerential Geometry , available at https://www-fourier.ujf-grenoble.fr ~demailly/manuscripts/agbook.pdf . [DHP13] J.-P. Demailly, C. D. Hacon, and M. P˘ aun, Extension theorems, non-vanishing and the existence of good minimal models , Acta Math. 210(2013), no. 2, 203– 259. [DL15] T. Dorsch and V. Lazi´ c, A note on the abundance conjecture , Algebraic Geom- etry2(2015), no. 4, 476–488. [DPS94] J.-P. Demailly, Th. Peternell, and M. Schneider, Compact complex manifolds with numerically eﬀective tangent bundles , J. Algebraic Geom. 3(1994), no. 2, 295–345.\nRIGID CURRENTS IN BIRATIONAL GEOMETRY 19 [DS10] T.-C. Dinh and N. Sibony, Super-potentials for currents on compact K¨ ahler manifolds and dynamics of automorphisms , J. Algebraic Geom. 19(2010), no. 3, 473–529. [FT23] S. Filip and V. Tosatti, Canonical currents and heights for K3 surfaces , Camb. J. Math. 11(2023), no. 3, 699–794. [Fuj17] O. Fujino, Foundations of the minimal model program , MSJ Memoirs, vol. 35, Mathematical Society of Japan, Tokyo, 2017. [Har77] R. Hartshorne, Algebraic geometry , Graduate Texts in Mathematics, vol. 52, Springer-Verlag, New York, 1977. [KM98] J. Koll´ ar and S. Mori, Birational geometry of algebraic varieties , Cambridge TractsinMathematics, vol.134, Cambridge UniversityPres s, Cambridge, 1998. [Laz23] V. Lazi´ c, Abundance for uniruled pairs which are not rationally conne cted, Enseign. Math. (2023), https://doi.org/10.4171/LEM/1065 . [Laz24] ,A few remarks on eﬀectivity and good minimal models , arXiv:2401.14190. [Leh13] B. Lehmann, Comparing numerical dimensions , Algebra Number Theory 7 (2013), no. 5, 1065–1100. [LT22] V. Lazi´ c and N. Tsakanikas, On the existence of minimal models for log canon- ical pairs , Publ. Res. Inst. Math. Sci. 58(2022), no. 2, 311–339. [LX23] V. Lazi´ c and Z. Xie, Nakayama–Zariski decomposition and the termination of ﬂips, arXiv:2305.01752. [Nak04] N. Nakayama, Zariski-decomposition and abundance , MSJ Memoirs, vol. 14, Mathematical Society of Japan, Tokyo, 2004. [Siu74] Y. T. Siu, Analyticity of sets associated to Lelong numbers and the ext ension of closed positive currents , Invent. Math. 27(1974), 53–156. [SSV23] N. Sibony, A. Soldatenkov, and M. Verbitsky, Rigid currents on compact hy- perk¨ ahler manifolds , arXiv:2303.11362. [Tom08] M. Toma, On the K¨ ahler rank of compact complex surfaces , Bull. Soc. Math. France136(2008), no. 2, 243–260. Fachrichtung Mathematik, Campus, Geb ¨aude E2.4, Universit ¨at des Saarlan- des, 66123 Saarbr ¨ucken, Germany Email address :lazic@math.uni-sb.de Institut ´Elie Cartan de Lorraine, Universit ´e de Lorraine, 54506 Nancy, France Email address :zhixin.xie@univ-lorraine.fr\n",
  "metadata": {
    "paper_id": "2402.05807v1",
    "downloaded_at": "2025-08-29T17:36:48.590427+00:00"
  },
  "processed_at": "2025-08-29T17:36:48.590443+00:00"
}