{
  "content": "arXiv:astro-ph/0606507v1 21 Jun 2006SimulationforKM3NeTusingANTARES-Software SebastianKuch University Erlangen-N¨ urnberg, Physikalisches Institut , Erwin-Rommel-Str.1, D-91058 Erlangen Abstract The KM3NeT project is a common European eﬀort for the design o f a km3-scale deep-sea neutrino telescope in the Mediterranean. For the upcoming Design Study simulations h ave been done using modiﬁed ANTARES software. Several concepts and ideas have been tested for their merits and feasibility. Key words: Neutrino telescope, Neutrino detection 1. Introduction The European neutrino telescope experiments [1]havejoinedtheireﬀortsintheKM3NeTproject [2] to design a km3-scale deep-sea neutrino tele- scope in the Mediterranean. A neutrino telescope of these dimensions on the Northern hemisphere, complementary to IceCube [3], is necessary for high-energy neutrino astronomy. As a ﬁrst step for the KM3NeT project, a de- tailed simulation study of diﬀerent detector mod- els and photo-detectors is necessary. The software used by the ANTARES collaboration, with some modiﬁcations, is ﬂexible enough for this task and was used for this study. The modiﬁcations include the adaptation to a larger detector and a new causality ﬁlter for the event reconstruction [4]. In addition some changes were necessary to implement the diﬀerent photo- detection systems presented in this work. Nonethelessthereconstructionandtheselection cuts are optimized for ANTARES, and are there-fore not necessarily optimal for diﬀerent detector designs. However as the results show similar ef- ﬁciencies for the detector models studied in this work and for the ANTARES detector, any recon- struction induced ineﬃciencies must be small. Theeventsampleusedcontained109muonneu- trinos with energies distributed between 10 and 107GeV and incident isotropically from the whole solid angle. Only charged-current νN interactions weresimulated,andthehadroniccomponentofthe ﬁnal state was neglected. A40K background rate of 91 Hz per cm2of photocathode area was used, correspondingto40kHzfora10”Photomultiplier. For comparison of diﬀerent detector models the neutrinoeﬀectiveareawascalculatedasafunction ofthe neutrino energy.The angularresolution,de- ﬁned as the median angular deviation between re- constructed and true neutrino direction, was de- rived from the results, again as a function of en- ergy. Preprint submitted to Elsevier Science 29 September 2018\nPMs Subcylinderscable HVElectronics PMs Fig. 1. From left to right: ANTARES storey; Schematic view of single and triple cylinder layouts, see [5]. 2. The cylindrical storey The diﬀerent Photomultiplier (PM) conﬁgura- tions(storeys)consideredinthisworkaredepicted in ﬁg.1. •ANTARES storey with 3 10” PMs. •Single Cylinder with 35 3” PMs, where each PM is read out individually. •Three smaller cylinders with 12 3” PMs each, hits occuring in one of the sub-cylinders, within a predeﬁned time window are added. The overall Photocathode area of these struc- tures is comparable. Small PMs generally have a higher quantum eﬃciency and a better Transit Time Spread (TTS). A disadvantage of the sin- gle cylinder structure lies in its vulnerability to mechanical stability problems. Additionally indi- vidual readout of 35 PMs within a very conﬁned space might not be feasible. Therefore the triple cylinder variant was proposed. By adding hits in one sub-cylinder the amount of necessary readout electronics is reduced considerably. , GeVνE2103104105106107102neutrino effective area, m -610-510-410-310-210-110110210310 Antares storey single cylinder triple cylinder Fig. 2. Neutrino eﬀective areas for a cube grid detector, instrumented with the diﬀerent storey structures. Forcomparisonthesephotodetectorunitswhere placed in a cubic kilometer grid with a string and storey distance of 62 .5m (4913 storeys). Eﬀective areas calculated for these detectors are shown inﬁg.2. Obviously the single cylinder storey is supe- rior at energies below 1TeV. The reconstruction requires a certain minimal numberofPMhits, a fact that isespeciallyimpor- tant at low energies, where the number of signal hits is very low. In the single cylinders the high number of individual hits explains the good low- energy eﬃciency. AtenergiesbetweenoneandafewhundredTeV, the single and triple cylinder storeys are compa- rable and both superior to the ANTARES storey. For the single cylinder this can again be explained by a larger number of hits. The reason in case of the triple cylinder is the requirement of local coin- cidences in one storey and/or hits with high am- plitudes. Coincident hits in one of the triple cylin- ders are added and therefore transformed into a high amplitude hit. The angular resolution is very similar for all three cases, with a common overall median of 0 .07◦. 3. Inhomogeneous geometries Theeﬃciencyofadetectoratlowenergiesiscor- related to the distance between the PMs. A pos- sible way to combine low- and high-energy perfor- mance is to use clusters of densely instrumented stringsasshowninﬁg.3.Low-energymuonshavea highdetectionprobabilityinsidetheclusters,while high-energy muons have a chance to hit several of the clusters, thus seeing a large instrumented vol- ume. x, m-600 -400 -200 0 200 400 600y, m -600-400-2000200400600string layout Fig. 3. Cluster layout: 5 clusters with 12 strings each, 4980 storeys. As expected, eﬀective area (ﬁg.4), and angular resolution (ﬁg.5) are signiﬁcantly better than for the cube at energiesbelow 20TeV. At higher ener- gies the performance is about 20% worse. 2\n, GeVνE2103104105106107102neutrino effective area, m -610-510-410-310-210-110110210310 single cylinder cube single cylinder clusters Fig. 4. Neutrino eﬀective areas for a cluster detector in- strumented with single cylinder storeys. , GeVνE210310410510610710median angular error, degrees-210-110110210 single cylinder cube single cylinder clusters Fig. 5. Angular resolution for a cluster detector instru- mented with the single cylinder storeys. x, m-600 -400 -200 0 200 400 600y, m -600-400-2000200400600string layout x, m-600 -400 -200 0 200 400 600y, m -600-400-2000200400600string layout Fig. 6. Seaﬂoor layout of ring1 (left) and ring2 (right) detector: 200(199) strings, 5000(4975) storeys. Above approximately 1TeV the muon range in water exceeds the dimensions of the instrumented volume of a km3-scale detector. Starting from this energy, most of the muons will enter the detector from the outside. Therefore the cross section area of the detector starts to become more important than a densely instrumented volume. In order to exploit this eﬀect the design of a ring-shaped detector with a densely instrumented boundary was studied. Examples of string layouts for such detectors are shown in ﬁg.6. Eﬀectiveareasfortherings,asshowninﬁg.7,are slightly higher at low energies, due to the denser storey spacing in the ring. The angular resolution, GeVνE2103104105106107102neutrino effective area, m -610-510-410-310-210-110110210310 single cylinder cube single cylinder ring1 single cylinder ring2 Fig. 7. Neutrino eﬀective areas for ring detectors instru- mented with single cylinder storeys. is very similar to the homogeneous case. 4. Conclusions SeveralpromisingconceptsofPMconﬁgurations andgeometriesforthedesignoftheMediterranean km3neutrino detector were considered. Through simulations it was shown that the use of many small PMs in pressure cylinders can provide better performance as conventional large hemispherical PMs. Inhomogeneous geometries have been shown to increase eﬃciency at low energies with only small losses at high energies, whiledrasticallyreducingthe numberofnecessary strings. Thesimulationsalsodemonstratedthat ringge- ometries are a possible way to reduce the number of strings without any loss of performance. The decision for a deﬁnite conﬁguration has to depend on the physics priorities of the project, as the performance of the diﬀerent detector concepts depends on the neutrino energy. Further studies with dedicated software for a km3-scale detector are absolutely necessary to further clarify the re- sults presented here, since the software used for thisworkisoptimizedfortheANTARESdetector. References [1] U.F. Katz, astro-ph/0601012 [2] http://www.km3net.org [3] J.Ahrens et al., Astropart.Phys. 20 (2004), 507 [4] D. Zaborov, VLVnT Workshop, Amsterdam, Oct 2003 3\n[5] P.Kooijman, these proceedings 4\n",
  "metadata": {
    "paper_id": "astro-ph/0606507v1",
    "downloaded_at": "2025-08-29T23:02:39.222079+00:00"
  },
  "processed_at": "2025-08-29T23:02:39.222089+00:00"
}