{
  "content": "arXiv:astro-ph/0610885v1 30 Oct 2006PNPI/08.2006 Currents of non-uniformities in solar atmosphere S. I. Stepanov∗ (Dated: March 8, 2018) Non-uniformities of plasma and magnetic ﬁeld are known to ca use electric currents in plasma. Electron density gradient causes diﬀusion current, electr on temperature gradient — thermocurrent, gradient of magnetic ﬁeld module — gradient current, curvat ure of magnetic ﬁeld lines — centrifugal current. Being independent of electric ﬁeld, the currents o f non-uniformities may act as extraneous to cause charge separation and electric ﬁeld in plasma. In co smos, the currents of non-uniformities were observed; in particular, gradient and centrifugal cur rents — in magnetosphere, diﬀusion one — in a comet coma and in artiﬁcial plasma cloud. On present wor k, the gradient current was inves- tigated more fully than earlier. Two unknown components, pa rallel and perpendicular to magnetic ﬁeld were found. The equation for gradient current density w as obtained. We compared the theo- retical densities of currents of non-uniformities (with us age of electron pressure and corresponding gradients) with measured current densities (calculated as rotor of magnetic ﬁeld) for sun photo- sphere. It follows from the comparison that the currents of n on-uniformities play important, may be main, role in measured local current in photosphere. It is necessary to consider in electromagnetic models. PACS numbers: 52.25.Fi, 94.30.Kq, 96.60.Hv Introduction It is commonly believed that magnetic ﬁeld of Sun is generated by convective motions of plasma inside the star. The ﬁeld, together with the electric currents be- ing the source of the ﬁeld, rises to upper layers of Sun, its atmosphere. There, the ﬁeld gives birth the observed phenomena of solar activity such as spots, active regions, ﬂares, and mass ejections. The region of generation and the region of observation very diﬀer on the plasma pa- rameters, in particular on plasma density. This leads to a diﬀerence in the values of electron magnetization, β=ω/ν. (Here ωis the gyromagnetic frequency, νis the frequency of isotropization collisions.) In convective zone of the Sun (region of generation) β≈0, at the photosphere level β≈1, at chromosphere βamounts to hundreds, and it is still larger in corona. Because of very diﬀerent magnetization one should apply diﬀerent approaches for modeling electrical processes in these me- dia. Inside the Sun the conductivity may be regarded as scalar; the conductivity current be collinear to electric ﬁeld. This is namely the basis of standard magmeto- hydrodynamics (MHD) models. In the star atmosphere the plasma is anisotropic. In this case, the conductivity current has tree components, — parallel (magnetic ﬁeld- aligned) current, Hall current, and perpendicular (Ped- erson) current. It is obvious that the standard MHD model being applied to the anisotropic plasma of star atmosphere cannot bring a true result. To take into ac- count the anisotropy, the simplest approach now is used: the currentis assumedto be parallelto the magneticﬁeld (free-force approach). ∗Petersburg Nuclear Physics Institute of the Russian Academ y of Sciences, St.-Petersburg, Russia; Electronic address: stepanovsmail@mail.ruPlasma of solar atmosphere is very non-uniform medium; this appears in gradients of density, temper- ature and non-uniform magnetic ﬁelds. In such the plasma, currents of non-uniformities — diﬀusion, ther- mocurrent, and gradient current— may play an essential role. At present we may see the tendency to take partly into account these currents. Electromagnetic plasma modelshavebeenpublishedwithhavingappliedHallcur- rent [1, 2], diﬀusion current [3], thermocurrent [4], and with applying a number of currents [5, 6]. Distribution of magnetic ﬁelds and currents in solar atmosphere is a hot point of solar physics. The current densityinphotospheremaybededuced bymeansofmag- netic ﬁeld rotor; or the presence of the currents may be found on deviation of the ﬁeld from so-called potential ﬁeld. Structure of magnetic ﬁeld in solar atmosphere may be revealed on soft X-rays and H αimages, and on extrapolation of the ﬁeld being measured on photosphere level. It is known that vertical magnetic ﬁeld-aligned cur- rents with the value up to 1012A ﬂow upward and down- ward in a sunspot [7]. It turned out that these currents, being close together, are an universal property of the spot, and moreover they cover a large share of an ac- tive region [8, 9, 10, 11, 12, 13, 14]. A little is known on nature of the currents. In electromagnetic models they are simply postulated as initial conditions [15, 16]. Itwasfoundthattwistedmagneticﬂuxtubesrepresent typical phenomenon. Another observation relatively the tubes — they expand slightly with increasing the height in atmosphere [9, 10, 11, 17, 18]. It follows from Maxwell equations that both the phenomena arise because of elec- tric currents being present in the tube. The twist arises due to longitudinal currents, the absence of tube expand- ing appears due to currents embracing the tube, — this is akin to a solenoid current encircling the magnetic ﬁeld of constant diameter. It is diﬃcult to study horizontal currents by a direct\n2 method, by means of calculating the magnetic ﬁeld ro- tor. Sparse papers show that these currents take place in active regions [19]. Accurate analysis of magnetic ﬁeld strength at some heights over photosphere was ful- ﬁlled in [20]. The ﬁeld in temperature minimum zone was found being noticeably larger than in middle photo- sphere. This points out at existence of horizontal cur- rents in there. Studying the currents in active regions is of particular interest in the context of ﬂare activity. There are the- oretical and experimental evidences that solar ﬂares are energizedbythemagneticﬁeldinactiveregion. Atoneof ﬁrst theory [21, 22], a loop of electric current plays main role in a ﬂare. A part of the loop is situated beneath photosphere, and another part — in solar atmosphere. The loop carries the current up to 1012A. The ﬂare be- gins when suddenly disruption of the current happens in atmospheric part of the loop. In the place of disruption a large electrical voltage, say 1010V, appears. On theory, the place of energy release has the dissipation factor j·E (a scalar product) being positive. It is important that the place of energy release has very smaller volume than the place where the magnetic energy was stored. In general, such the scenario provesbe true in later ob- servations. The sites of ﬂares are linked with the places where the currentsare concentratedat photospherelevel, in other words, — with the places of non-potential mag- netic ﬁeld [20, 23, 24]. Some studies show that ﬂare is coupled with two magnetic ﬁeld loops [9, 25, 26] or with severalloops from which only two play main role [11, 17]. Both loops carry electric currents, in particular parallel currents. One, a high-lying loop, exists long before the ﬂare. Certainly this loop accumulates magnetic energy. The onset of the ﬂare correlates with the emergence of a smaller low-lying loop. There are observations that the ﬂare begins in the place where the loops interact — X-ray source may be seen here. Then the ﬂare process spreads along the loops attaining their footpoints. The ﬂare energy is about 5–10% of stored magnetic energy; the high-lyingloopisseen tosurviveafterthe ﬂare. Max- imal magnetic ﬁeld strength was noticed in peak of the ﬂare[10, 20]. Themagneticﬁeldsandelectriccurrentsof- ten appear to simplify their structure after the ﬂare [27]. Magnetic ﬁelds are everywhere observed in galaxies. In spirals, orientation of the ﬁeld are often (not always) parallel to arms: the ﬁeld is of the values 3–10 µG[28]. As mentioned for a long time, magnetization is very high for all kinds of interstellar medium. Electron magnetiza- tion in cold interstellar gas, zone H1, ( T= 30−70◦K, hydrogen concentration is of 20–40 cm−3) amounts to 107, electron magnetization in coronal ionized gas is of 1011[29]. Magnetic ﬁeld with the strength of 22 mGwas found in the corona of the circumstellar disk of young stellar object at the distance 40 a.u. from the object [30]. Even in that, most dense medium, magnetization is not smaller than 200. In contrast to stars, magnetic ﬁeld in intragalactic medium is observed in the same place where being gen-erated. Because the magnetization is very high there, the electromagnetic theory should be from the very out- set formulated on base of anisotropic conductivity. This relates fully to the magnetic ﬁeld in clusters of galaxies. In Earth magnetosphere, at the latitude of some ten thousand kilometers, a ring current ﬂows; it was directly detected in ﬂyby of rocket [31]. Magnetic storm arises when a cloud of coronal plasma enters inside Earth’s magnetic ﬁeld and this causes increase in this magneto- sphere current. It is well known that the magnetosphere current represents, on its nature, a sum of gradient and centrifugal currents. Notice, the magnetization in the magnetosphere is very high. The same conditions — the gradient of magnetic ﬁeld module, the curvature of mag- netic lines, and high magnetization take place in stellar atmosphere. Hence, one should expect that the gradient and centrifugal currents are present there; and the task arises — how much large are the currents and what is their role in electromagnetic phenomena? Plasma currents arising from non-uniformities A current of charged particles arises due to ﬁelds, non- uniformity, and anisotropy of medium [32]. Let us list the currents what were detected in cosmic plasmas: 1. Conductivity current. It is caused by electric ﬁeld. 2. Diﬀusion current. It is due to gradient of charged particle density. 3. Thermocurrent. This current is also named as ”thermodiﬀusion” current, ”thermoelectric eﬀect” and ”Nernst eﬀect” [4]. This current is due to gradient of charged particle temperature provided that collision fre- quency has some dependence of velocity of charged par- ticles [33]. In the absence of magnetic ﬁeld the nature of diﬀusion and thermocurrents are quite similar to dif- fusion and thermodiﬀusion in gas. In presence of mag- netic ﬁeld both the currents (more precisely their Hall components) are often called as ”diamagnetic eﬀect” be- cause this eﬀect leads to weakening of magnetic ﬁeld in spatiallyrestrictedplasma. In cosmicconditions diamag- netic eﬀect was conﬁdently observed in comet coma [34] and in the plasma cloud made by explosion of metal in ionosphere [35]. 4. Gradient current. It arises when the module of magnetic ﬁeld changes in space. 5. Centrifugal current. It arises in magnetic ﬁeld with curved lines. These currents arise due to non-uniformities of poten- tial, plasma, and magnetic ﬁeld. We will name these currents as the currents of non-uniformities. In some cases, another currents may be essential, for example, the current of entrainment of electrons by pho- tons and currents caused by waves. A current in plasma is calculated in diﬀerent ways de- pending of the parameter λ/l,λis the free path (or giro- radius) of the particle, lis the typical plasma dimen- sion. For the case of ﬁnite λ/l, each the current must\n3 be calculated for given plasma geometry, magnetic ﬁeld, etc. For tokomaks, the current dependent of plasma and temperature gradients, — named ”bootstrap current”, has been calculated [36]. In cosmic plasma the relation λ/l≈0 takes place as a rule. In this case the currents are roughly deﬁned by local plasma conditions and uni- versal equations may be obtained for density of diﬀerent currents. But in some cases the currents are non-local: the current associatedwith particlesacceleratedin ﬂares, for example. The total current is the vector sum of currents of the diﬀerent kinds, each for electrons and ions: j=jE+jD+jT+j∇B+jR+ +similar currents for ions + another currents .(1) HerejE,jD,jT,j∇B, andjRdesignates the density of conductivity, diﬀusion, thermocurrent, gradient, and centrifugal current, accordingly. It is natural, that the density of the total current simultaneously satisﬁes to Maxwell equation thereby making it possible measuring the current through magnetic ﬁeld rotor. From the available literature it appears that equations for density of the conductivity, diﬀusion, and thermocur- rents are known for a wide range of plasma parame- ters [33, 37]. At the presence of a magnetic ﬁeld each the current has three components. For example, components of the conductivity current are directed on the mutually perpendicular vectors E/ba∇dbl,E⊥, andE×B— parallel, perpendicular, and Hall component, respectively. The components of diﬀusion and thermocurrent have same names. The gradient of magnetic ﬁeld module, ∇B, is an ax- ial vector. Generally, it can be oriented with any way concerning the magnetic ﬁeld in the point. This al- lowsdecomposingthegradientintotwocomponents ∇/ba∇dblB and∇⊥B, being parallel and perpendicular to the mag- netic ﬁeld, Fig. 1(a). The mutually perpendicularvectors ∇/ba∇dblB,∇⊥B, andB×∇Bdeﬁne the coordinate axes Z, X, and Y, respectively. When speaking about the gradient current, one keeps in mind its component, which being directed at the vector B×∇B, see Ref. [38], for example. The formula for this ”Hall” component is deduced and applied for a case of inﬁnite magnetization — collision- less plasma. The originofthis componentis presented on Fig. 2(b). The Hall gradient current is well known on ob- servations of electric phenomena in plasmas. As mention above, this current creates, together with the centrifugal current, the ring current in magnetosphere. It is likely assume, that there are not one, but three components of the gradient current. Two unknown components will be considered as directed on the vectors ∇/ba∇dblBand∇⊥B and be named as parallel and perpendicular components, respectively.Parallel component of gradient current Let us show that the parallel component of the gra- dient current does exist, and estimate its value. In the beginning of the consideration we will follow to histori- cally developed scheme, for example, see [38]. In magnetic ﬁeld a charged particle gyrates. This movement may be characterized by a magnetic moment µ=mV2 ⊥/2B=ε⊥/B. (2) HereV⊥is the perpendicular (to the ﬁeld) component of velocity, ε⊥is the perpendicular kinetic energy, mis the mass of the particle. For researchingthe parallel component it is convenient to take the ﬁeld in which the gradient is parallel to the ﬁeld itself, Fig. 1(b) and Fig. 3. As known, in this ﬁeld the particle undergoes to the mean Lorentz force ∝angb∇acketleftf∝angb∇acket∇ight=−µ∇B. (3) Irrespective of the sign of the charge the force is directed to weaker ﬁeld, see Fig. 3. As the particle gyrates, the parallel component of ve- locityincreases,andtheperpendicularonedecreases. To- tal velocity of the particle remains, because kinetic en- ergy of the particle does not change in interaction with a magnetic ﬁeld. Thus there is ejection of the charged particles and thereby all the plasma into the weaker ﬁeld area. The ejection of plasma is essential for very and fully ionized plasma, — this is chromosphere and corona as applied to the Sun. The magnetic ﬁeld with ∇B∝ba∇dblBis used in the devices for magnetic conﬁnement of plasma — magnetic bottles. Here we complete citing the histor- ical consideration. Let’s continue the consideration to show that the lon- gitudinal Lorentz force causes an electric current. We will consider weakly ionized plasma, i.e., in which the electron-neutral and ion-neutral collisions prevail over the collisions between the charged particles. Also assume a large, but ﬁnite magnetization— that is a largeenough magnetic ﬁeld. Let observe the motion of the particle between suc- cessive collisions. After a collision all the directions of the velocity are equiprobable; the mean parallel velocity is zero. Due to action of parallel Lorentz force there is acceleration a=∝angb∇acketleftf∝angb∇acket∇ight/m=µ∇B/m=−V2 ⊥∇B/2B. (4) Because the electron velocity is larger than the ions, it is seen from Eq. (4) that there is the preferred ﬂow of electrons, that is a current. To evaluate this current, col- lisions should be involved. Due to the parallel Lorentz force, directional velocity arises between collisions. As result of next collision, this directional velocity again disappears. To the time t= 1/ν(mean time between collisions), the directional velocity attains the value a/ν=−µ∇B/mν. (5)\n4 The mean (drift) velocity may be written as the half of that: Vdr=−µ∇B/2mν. (6) Forcurrentdensitythe standardformulamaybe written: j=qNVdr. (7) Hereqis the charge, Nis the concentration of charged particles of given sort. Substituting the need parameters in Eq. (7), the parallel current density may be expressed, on module j/ba∇dbl=qP∇B 2νmB. (8) HeremV2 ⊥N/2≡P⊥=P,P⊥is the perpendicular pres- sure,Pis the pressure of the charged particles. Let’s compare the parallel currents for electrons and ions assuming their temperatures being same. Transport cross sections for the ion-atom collisions exceed them for the electron-atom ones by some times. Accepting, nevertheless, for simpliﬁcation, these cross sections be- ing identical, we receive from Eq. (8) the approximate dependence of the parallel current on the mass of the particle j/ba∇dbl∝1/νm∝m−1/2(9) The density of the electron current is very greater than the ion’s. This feature is explicitly shown on Fig. 3. The dependence expressed by Eq. (9) is same as that for con- ductivity current. Algorithm for calculating the current density As mentioned, the density of the Hall gradient current was deduced for a case of collisionless plasma [38]. In such the calculations a drift approach is generally used. This approachhas some limitations. Now it is considered more reliable to use an algorithm suitable for arbitrary magnetization β. Equation for the collisionless plasma may be received as the limit β→ ∞[39]. In the present work we will follow such a way. We took the algorithm what widely exploited for ﬁnd- ing the drift velocity in homogeneous ionized medium with applied uniform electric and magnetic ﬁelds, but we used this algorithm when non-uniform magnetic ﬁeld is applied. (In the case of non-homogeneous medium — there are gradients of density or temperature — another, more complex algorithm should be applied.) Directly after a collision all the directions of the scat- teredparticleareequiprobable,—thecollisionmakesthe mean velocity to equal zero. Then the particle interacts withtheﬁeld, —electric, magneticorboth. Thisinterac- tion brings asymmetry in the movement of the particle. To the time of next (second) collision the particle has(a) (b) (c) Z YX∇B∇ B∇⊥ BB ∇BB ∇BB FIG. 1: Coordinate system and magnetic ﬁelds being used for calculating. (a) arbitrary disposition of vectors ∇Band B. Vector ∇Bmay be decomposed at parallel and perpen- dicular components, which deﬁnes, in this work, the axes Z and X respectively. Vector B×∇Bdeﬁnes the axis Y. (b) non-uniform magnetic ﬁeld with ∇B/ba∇dblB. It was used for cal- culating the parallel component of gradient current, see al so Fig. 3. (c) non-uniform magnetic ﬁeld with ∇B⊥B. It was used for calculating the perpendicular and Hall components of gradient current, see also Fig. 2. received some average shift in space. Let rbe the radius- vector of the particle in the moment of the next collision relatively the ﬁrst. Then the average shift between the subsequent collisions is ∝angb∇acketleftr∝angb∇acket∇ight=∑ ri/ncoll. (10) Herencollis the number of the collisions has been in- cluded in the calculation. As a result of the second collision, the directions of the velocity become again isotropic. Assuming station- arity, the velocity distribution function does not depend on time. Thus the movement after the second collision will occur in same a way as after the ﬁrst. Hence, it is well enough to take into account the movement of the particle between the ﬁrst and second collisions. Inelastic collisions may be omitted in the calculation because they are already taken into account in the velocity distribu- tion function. Thus, average (drift) velocity, which the particles get in the applied ﬁeld, is Vdr=∝angb∇acketleftr∝angb∇acket∇ightν. (11) As the drift velocity becomes known, Eq. (7) gives the current density. It follows from above, that the calculation of the drift velocity reduces to calculating the vector ∝angb∇acketleftr∝angb∇acket∇ight. Several methods — Monte Carlo, regular, and combined — were used to yield an identical result. The regular method as being fastest has been described below. The solid angle 4 π, in which the particle equiprobably scatters, is divided into small angles Ω i. The vector of initial velocity is the average on the angle Ω i: Vi(0) =V(0)∝angb∇acketleftΩi∝angb∇acket∇ight. (12)\n5 (a) (b) (c) ∇BB XY XY FIG. 2: The mechanism of perpendicular and Hall compo- nents of gradient current. (a) the magnetic ﬁeld being used for calculating. The ﬁeld growths downwards; the gyroradiu s decreases downwards. (b) the origin of drift velocity for la rge magnetization (strong ﬁeld, sparse plasma). (c) the case of small magnetization. First collision occurs in the center o f coordinate. The motion of positive particle being scattere d up and down is shown; the trajectories have the length being equal to free path. Mean shift between collisions is deﬁned as center of gravity for the locations of next collision. As o b- vious from panel (b), for large βthe mean Y coordinate of second collision is positive — this is well-known case of Hal l gradient current in collisionless plasma. To the contrary, it is seen from panel (c) that the mean Y coordinate for small βis negative. As consequence, the Hall component has diﬀerent signs for small and large β, see also Eq. (13). From panel (c) it is seen that a net shift along axis X is present, at its nega- tive direction. This means that the perpendicular componen t indeed takes place. With increasing β, as seen from panel (b), the mean X coordinate of second collision tends fast to zero. This well corresponds to behavior of the perpendicula r (diagonal) terms in matrix of Eq. (13). HereV(0) is the module of initial velocity (for its choice see below), ∝angb∇acketleftΩi∝angb∇acket∇ightis the mean normal to the area Ω i. In this method the concept of weight of scattered particle is used. The weight at the moment immediately after the collisionissupposed Wi(0) = Ω i/4π,whatcorrespondsto natural normalization∑textWi(0) = 1. When the particle is moving on a trajectory there is reduction of the weight due to collisions. During time ∆ tthe weight diminishes by ∆W(t) =W′(t)∆t=−W(0)exp(−tν)∆t. The code builds the trajectory of the particle moving in given ﬁeld. For each the time interval the value |∆Wi(t)|ri(t) is added to ∝angb∇acketleftr∝angb∇acket∇ight. The calculation for given scattered particle expires when its weight becomes less than a little value deﬁned beforehand. Finally, ∝angb∇acketleftr∝angb∇acket∇ight=∑ |∆Wi(t)|ri(t). This equation has the same meaning as Eq. 10. The sum is taken on the directions of scattered particles, on intervals of time and, if required, on the module of the initial velocity. The computation was made for Maxwellian distribu- tion function of charged particles on velocities. Bulk ofB ion electron O FIG. 3: The mechanism of parallel gradient current. The mo- tion of electron and ion in the magnetic ﬁeld with ∇B/ba∇dblB is shown between the collisions. The particles were assumed to have same energies. For clearness, the ion mass is taken by factor 4 larger than that of electron one. Hence, the ratio of gyroradiuses is of 2. The particles scattered in point ”O” in the direction perpendicular to the ﬁeld. First, a traject ory represents a circle; it turns out into a spiral due to paralle l Lorentz force acting upwards. The trajectories of both part i- cles are depicted for the time being equal to ion collision ti me. As for electron, it underwent two collisions for this time. ( As- suming the cross sections are same.) As seen, the electron ha s shifted at weaker ﬁeld direction by two times larger than the ion. Hence, the drift velocity is inversely proportional to the root of mass; see Eq. (13). the computation has been made for the monoenergetic particles with the initial velocity equal to the thermal velocity V(0) =VT≡(8kT/πm)1/2. Additional computation has been made in which the initial velocity varied around VT; the initial weight was multiplied by a normalized factor. It presented the frac- tion of the particles with the given velocity module in the Maxwellian distribution. The both computations — with ﬁxed and varying velocity module — gave the same result. Code execution yields in numerical data of the drift velocity, being computed for the diﬀerent magnetization β. The code was used for calculation of drift velocity in the ﬁelds: The non-uniform magnetic ﬁeld for a case ∇B∝ba∇dblB, Fig. 1(b) and Fig. 3. The non-uniform magnetic ﬁeld for a case ∇B⊥B, Fig. 1(c) and Fig. 2. Uniform electric and magnetic ﬁelds for a case E∝ba∇dblB. Uniform electric and magnetic ﬁelds for a case E⊥B. The last two cases served for the aim of control. They gave the numerical values which corresponds to a well- knownequationoftree-componentsconductivitycurrent. Equation for gradient current density To ﬁt the numerical data generated by the code, the empirical equation for gradient current density was de-\n6 vised. The equation reprodices the numerical data with accuracy of 1% for a small magnetization and 5% for large one: j∇B=−8qP π2νmL 2Zβ2 (β2+1)2−β(β2−1) (β2+1)20 β(β2−1) (β2+1)22Zβ2 (β2+1)20 0 0Zβ2 β2+1 I.(13) HereIis the unit vector in direction of the gradient of magnetic ﬁeld module, Lis the characteristic length of change of magnetic ﬁeld module: I=∇B/|∇B|, L=B/|∇B|, (14) ∇B≡ ∇XB ∇YB ∇||B , Zis the sign of charge. It is seen from Eq. (13) that Hall component of gra- dient current (being long known for inﬁnite β) has the remarkable feature: it changes the direction at β= 1. Fig. 2 shows why this occurs. This property was not known formerly. For comparison, let’s copy out from [33] the equation for the density of diﬀusion and thermocurrent for weakly ionized plasma, for electrons: jD,T=qP νmL Z β2+1−β β2+10 β β2+1Z β2+10 0 0 −Z I.(15) If Eq. (15) describes the diﬀusion current, L≡Ne/|∇Ne|,I≡ ∇Ne/|∇Ne|, whereLis the characteristic length of change of electron densityand Iistheunitvectoronconcentrationgradient. If Eq. (15) describes the thermocurrent, L≡Te/|∇Te|,I≡ ∇Te/|∇Te|, whereLis the characteristic length of change of elec- tron temperature and Iis the unit vector on tempera- ture gradient. For the case of thermocurrent, Eq. (15) is valid when collision frequency independent (weakly de- pendent) of charged particle velocity. Equation (15) will also describe the conductivity cur- rent if admit L=ǫT/qEandI=E/E, that is L is the length on which the electron attains the thermal energy ǫTin the given electric ﬁeld EandIis the unit vector in the electric ﬁeld direction. It is seen from comparison of equations (13) and (15) that the density of gradient current at large βhas the same asymptotic as that for diﬀusion and thermocur- rent. The parallel components of all the currents are independent of β, Hall components behave as 1 /β, and the perpendicular components behave as 1 /β2. Equations (13) and (15), being written in the same form, allow us to evaluate and to compare the densities of diﬀerent currents in the plasmas of interest.Currents of non-uniformities as extraneous currents A current may be classiﬁed in relation to electric ﬁeld — the current independent on electric ﬁeld may be ex- traneous. For an extraneous current, the factor of dis- sipation j·Eis negative. It is positive for conductiv- ity current and it is zero for Hall current — the later is nondissipative current. Due to action of extraneous cur- rent a part of the energy of charged particles turns into the energy of electric and magnetic ﬁeld. Diﬀusion and thermocurrents, being independent of electric ﬁeld, may be extraneouscurrents — at properdi- rection of the electric ﬁeld. Generators of electricity have been workedout on baseofdiﬀusion andthermocurrents. Being also independent of electric ﬁeld, gradient and centrifugal currents may also be extraneous. A place where they evince as extraneous is again the magneto- sphere. Be the magnetosphere axially symmetric, the current (sum of gradient and centrifugal ones) were of constant value along its round. No electric ﬁeld would arise. But as result of interaction with solar wind, the magnetosphere is an asymmetric structure. Hence the sum of two currents has diﬀerent value along equato- rial round of the magnetosphere. Is the total (extra- neous) current unclosed? No, gradient and centrifugal currents create a charge separation, followed by electric ﬁeld. Conductivity current appears. So, total current (including the tree currents) forms the closed circuit of observed magnetospheric ring current. (This circuit may be partly branched oﬀ in ionosphere.) Currents of non-uniformities on sun photosphere and on other plasmas Let’s raise the question, — currents of what nature participate in the currents observed in atmosphere of the Sun? For the answer we will evaluate, with use of equa- tions (13) and (15), the densities of diﬀerent currents at photosphere level and compare them with the observable current density. The electron concentration is taken from [40]. From these data, the characteristic length of change of electron density at vertical has been calculated; it turned out to be 70 km. From the same data, the characteristic length of change of electron temperature on vertical at photo- sphere level was obtained to be about 600 km. The elec- tron density changes faster than the temperature. Such the relationship is expected for weakly (partly) ionized plasma: onSahaequation, asmallchangein temperature leads to larger change in degree of ionization, following in large change in the electron density. For evaluating the gradient current density with use Eq. (13) we need know the typical length of change of magnetic ﬁeld module. Magnetic ﬁeld in solar atmo- sphere is known to be very structural, it rather con- sists of small-scale magnetic elements — magnetic ﬂux tubes [41]. The cross size of the magnetic elements\n7 at photospheric level is smaller than the resolution of magnetometers. Hence it is impossible building tree- dimensional structure of the magnetic ﬁeld and deﬁning the length of change of magnetic ﬁeld module from it. There are methods what allow us to learn more about the magnetic ﬁeld at smaller scales than the resolution limit. The procedure of inversion of Stokes proﬁles is applied to the polarization of magnetic lines in single resolution elements [42]. Inversion of Stokes proﬁles reveals that two diﬀerent magnetic components coexist in one resolu- tion element with the size of 0”.3–1”.0 = 220–750 km. A large fraction of the ﬁeld strengths was measured being in kG regime. A fraction of observed Stokes proﬁles re- quires opposite polarities in the resolution element. Such the method being especially applied to the diﬀerent lines or to the lines in visible and infrared range allows evalu- ating the mean unsigned ﬂux density and the longitudi- nal component of the magnetic ﬁeld. Then, ﬁlling factor (being one – several percents) and character size of the magnetic elements may be obtained [43]. The next data on characteristic size (diameter) of small-scale magnetic elements in quiet photosphere may be found in literature: 75 km [43], 96–118 km [44], 100– 200km [45], 40–220km [46], 100km [47], 50–100km [48], 140 km [49]. Electron magnetization βbeing calculated for the ef- fective ﬁeld 1 kG is given on Tab. I. Another method for revealing the magnetic structures includes imaging the Sun in molecular G-band [44], in the wings of strong spectral lines such as H αand Ca II H and K [45]. It was stated that the mean equivalent diameter of the magnetic structures is of 100–300 km, at the limit of resolution of ground-based solar telescopes. Summing these data, we may say that the character- istic diameter of small-scale magnetic elements in quiet photosphere is of 75–300 km. Obviously, for the char- acteristic length of change of magnetic ﬁeld module the associated radius, 40–150 km, should be taken. Evidently, there is mechanical balance on horizontal of the magnetic structures with surrounding plasma [50]. Gas pressure and magnetic pressure, being deﬁned at the same photospheric level, must anticorrelate in ac- cordance with equation Pgas+B2/8π= const. In such the case, the typical length of plasma density on hori- zontal should be the same as the characteristic length of change of magnetic ﬁeld module that is 40–150 km. This well agrees with the typical length of plasma density on vertical, 70 km. The given data allows us to evaluate the densities of diﬀerent currents on photospheric level. Because the magnetization is close to 1, the matrix elements in equa- tions (13) and (15) is of order 1 also. Hence, for our aim, either component of some current density may be presented by reduced equation j≈qP/νmL, (16) where the length Laccounts for 70, 600, and 40–150 kmTABLE I: Electron magnetization βand densities (in mA/m2) of currents of non-uniformities at photosphere levels of quiet sun evaluated on equations (13) and (15). H (km) β j D jT j∇B −40 0.41 6 .7 0 .6 3.3–13 −30 0.55 3 .5 0 .3 1.7–7 −17 0.69 1 .55 0 .14 0.8–3 0 0.82 0 .7 0 .06 0.35–1.4 22 0.97 0 .4 0 .05 0.2–0.8 TABLE II: Densities of vertical current measured at rotor of magnetic ﬁeld at photosphere level. jz(mA/m2) Resolution Reference Active regions ±2,...±20 2”πxel [12] ±7.5,...±12 3” ×2” [23] ±1.2,±2.4 4” [10] ±6,...±24 2” ×2” [17] −30,+50 1.1” [14] ±20,...±70 [19] ±7 [13] ±2.4,...±20 [9] Quiet photosphera ±0.1,...±0.2 4” [52] for diﬀusion, thermocurrent, and gradient current, ac- cordingly. Thedensitiesofcurrentsofnon-uniformities, beingcal- culated at Eq. (16) for these lengths are given on Tab. I. Now, of concern to us is observable currents in sun photosphere. The only current what can be measured in there is magnetic ﬁeld-aligned current in areas of strong vertical ﬁeld. Here ∇B∝ba∇dblB. In active regions includ- ing sunspots this current may be measured with enough accuracy on rotor of cross-to-sight magnetic ﬁeld. See Tab. II for the data. It is seen that the better the resolu- tion, the larger is the measured value of current density. This correlation was many discussed in literature. (This particularity in measurements appears because the cur- rent/magneticﬁeld structureshavesizessmaller than the resolution; and the currents in close structures can have opposite direction.) It is diﬃcult to measure transverse magnetic ﬁeld in quiet sun photosphere and to calculate vertical current there. Nevertheless, the estimation of the quiet sun cur- rents was made with use of chromospheric ﬁne structures seen in H αimages with comparison of theoretical chro- mosphericﬁeldobtainedbypotentialextrapolationofthe observed, line-of-sight photospheric ﬁeld [51, 52]. In area of unipolar vertical magnetic ﬁeld, there were found the currents (1–8) ×109A being directed upwards or down- wards, with the density of 0.1–0.2 mA/m2[52]. This density seems to be underestimated when the low resolu- tion in this work is considered. The structure of currents in unipolar hill of vertical ﬁeld in quiet regions resembles\n8 the current structure in a sunspot. We want to compare the measured currents with the currents of non-uniformities; in this comparison the cur- rents must fall to region with same conditions — quiet photosphere and, separately, active regions. Quiet photosphere. Let us compare the density of cur- rents of non-uniformities presented in Tab. I with only measured current presented in Tab. II. We may see that the measured current is smaller (even with regard to its underestimation) than the diﬀusion and gradient ones. From this it follows that the currents of non-uniformities are present in quiet photosphere and play important role in there. Active regions. It is known that both magnetic ﬁelds and gradients (of concentration, temperature, and mag- netic ﬁeld module) are larger in active photosphere than in quiet one. Hence, we may anticipate, that the currents of non-uniformities in active regions are larger than in quiet photosphere. Again, we see that the currents of non-uniformities participate in the photosphere currents and play essential role. To discuss the problem further, let us take in mind the directions of the currents. Because ∇B∝ba∇dblB, as the result of given work there is the parallel gradient cur- rent there; it consists of electrons moving upwards, to weaker magnetic ﬁeld region. There is the parallel dif- fusion current there, it also consists of electrons moving upwards, to smaller electron concentration. Thus, both currentsacttogether. Theyactasthe extraneouscurrent and give a charge separation following with macroscopic electric ﬁeld and conductivity current. The later is of opposite direction to the extraneous current. It may be proposed that there is diﬀerence of extraneous and con- ductivity currents; this diﬀerence is directed upwards or downwards. In Earth polar ionosphere, there are seen phenomena being considered as of similar nature to paired vertical currents on solar atmosphere. These are U-shape struc- tures consisting of two magnetic ﬁeld-aligned currents of opposite directions on distance of some hundred kilo- meters from each other [53]. It is appropriate mention here that both solar and ionospheric vertical currents are closed in area where electron magnetization is near 1. Phenomena accompanying the magnetic ﬁeld-aligned gradient current are observed in laboratory plasma. The plasma facility described in [54] has a magnetic ﬁeld with axial symmetry. The plasma source is located where the ﬁeld is maximal. In the center of the plasma volume the magnetic ﬁeld is weakest; and the negative potential about−300V has been measured there. On frame of the given work it is possible to assume that parallel gradi- ent plus diﬀusion currents cause the charge separation in the plasma; the negative potential evidences it. Also, a through current ≈1kAstreaming alongmagnetic lines is observedin the plasma. The direction ofthis currentcor- responds to movement of electrons towards weaker mag- netic ﬁeld and, atthe sametime, towardsweakerelectron density. The through current is presumably the gradientplus diﬀusion current, being partly canceled by the con- ductivity current of opposite direction. In the plasmas of interest the cross-magnetic ﬁeld cur- rents are observed: 1) the current in photosphere which closes the vertical currents inside a sunspot and inside the hill of vertical ﬁeld in quiet region, 2) the current in lower ionosphere what closes magnetic ﬁeld-aligned cur- rents in U-shape aurora structure, 3) equatorial electro- jet in lower ionosphere at the height 90–110 km. Pre- sumably, cross components (these are perpendicular and Hall ones) of gradient, centrifugal, diﬀusion, and also of conductivitycurrentincludetotheseobservablecurrents. Notice again that magnetization of electrons is near 1 in the areas of these transverse-magnetic ﬁeld currents. Extraneous currents (gradient, centrifugal, diﬀusion, and thermocurrent) when being coupled with conductiv- itycurrentmaybeconsideredoftogeneratethe magnetic ﬁelds in objects without convective motions — in stars of classes Am, Ap. Summary Results of this paper may be summarized as the fol- lows. 1. We gathered the observations of electrical currents in cosmic plasmas paying attention to the cases when nature of the current is known. By this is meant that the value of measured current agrees suﬃciently with the current calculated on a theo- retical equation (for a current of some type). The nature of the ring current in magnetosphere is well known — this is gradient plus centrifugal cur- rent. The current in comet coma and in artiﬁcial plasma cloud consists of diﬀusion and thermocur- rent. These four currents are the current of non- uniformities. 2. In the paper the gradient current was investigated more fully than earlier. Two unknown components of the current were found. An equation for gra- dient current density was obtained. The equation embraces tree possible components of the gradient current. 3. It was proposed that the currents of non- uniformities present on solar atmosphere. It was checked for photosphere. The measured vertical currents was compared with the currents of non- uniformities; the later were calculated at theoreti- cal equations. Theoretical values turned out to be the same or larger than the measured ones. 4. Hence it follows that the currents of non- uniformities indeed present in atmosphere of the star; the currents should be included into theoreti- cal models.\n9 [1] S. I. Vainshtein, S. M. Chitre, and A. V. Olinto, Phys. Rev. E61, 4422 (2000). [2] J. D. Huba and L. I. Rudakov, Phys. Rev. Lett. 93, 175003 (2004). [3] Chang-Mo Ryu and M. Y. Yu, Phys. Scr. 57, 601 (1998). [4] A.B. Hassam, R.M. Kulsrud, R.J. Goldston et al., Phys. Rev. Lett. 83, 2969 (1999). [5] S. J. Desch, Astrophys. J. 608, 509 (2004). [6] I. J. D. Craig and P. G. Watson, Sol. Phys. 214, 131 (2003). [7] A. B. Severny, Space Sci. Rev. 3, 451 (1965). [8] V. A. Abramenko, S. I. Gopasyuk, M. B. Ogir, Sol. Phys. 134, 287 (1991). [9] Hongqi Zhang, Astron. Astrophys. 324, 713 (1997). [10] V. M. Grigoryev and L. V. Ermakova, Sol. Phys. 207, 309 (2002). [11] Yang Liu, Maki Akioka, Yihuayan and Guoxiang Ai, Sol. Phys.177, 395 (1998). [12] Y. Liu and H. Q. Zhang, Astron. Astrophys. 386, 646 (2002). [13] Jeongwoo Lee, Stephen M. White, N. Gopalswamy, and M. R. Kundu, Sol. Phys. 174, 175 (1997). [14] S. R´ egnier, T. Amari, and E. Kersal´ e, Astron. Astroph ys. 392, 1119 (2002). [15] V. V. Zaitsev, A. V. Stepanov, S. Urpo, and S. Pohjo- lainen, Astron. Astrophys. 337, 887 (1998). [16] V. S. Titov and P. Demoulin, Astron. Astrophys. 351, 707 (1999). [17] Wang Tongjiang, Qiu Jiong, and Zhang Hongqi, Astron. Astrophys. 336, 359 (1998). [18] M. R. Kundu, A. Nindos, S. M. White, and V. V. Grech- nev, Astrophys. J. 557, 880 (2001). [19] H. S. Ji, M. T. Song, X. Q. Li and F. M. Hu. Sol. Phys. 182, 365 (1998). [20] V. G. Lozitsky, E. A. Baranovsky, N. I. Lozitska, and U. M. Leiko, Sol. Phys. 191, 171 (2000). [21] G. Jacobsen , R. Carlqvist, Icarus 3, 270 (1964). [22] H. Alfven and R. Carlqvist, Sol. Phys. 1, 220 (1967). [23] Unwei Zhao, Cheng Fang, and Ming de Ding, Sol. Phys. 173, 121 (1997). [24] I. A. Bilenko, A. I. Podgorny and I. M. Podgorny, Sol. Phys.207, 323 (2002). [25] Yoichiro Hanaoka, Sol. Phys. 173, 319 (1997). [26] R. Falewicz and P. Rudawy, Astron. Astrophys. 344, 981 (1999) [27] V. I. Abramenko, V. B. Yurchishin, and V. Carbone, Astron. Astrophys. 334, L57 (1998). [28] J. L. Han, R. Beck, M. Ehle, R. F. Haynes, and R.Wielebinski et al., Astron.Astrophys. 348, 405(1999). [29] E. N. Parker, Cosmical Magnetic Fields , (Clarendon Press, Oxford, 1979). [30] C. Thum and D. Morris, Astron. Astrophys. 344, 923 (1999). [31] S. S. Dolginov, N. V. Pushkov, Dokl. Akad. Nauk USSR 129, 77 (1959).[32] V. I. Belinicher and B. I. Sturman. Usp. Phiz. Nauk 130, 415 (1980). [33] V. A. Rozhansky, L. D. Tsendin, Transport Phenom- ena in Partially-Ionized Plasmas , (Bristol, Gordone & Breach, 2000). [34] P. L. Israelevich, A. I. Ershkovich, and F. M. Neubauer, Astron. Astrophys. 329, 765 (1998). [35] B. G. Gavrilov, A. I. Podgorny, I. M. Podgorny et al., Geophys. Res. Lett. 26, 1549 (1999). [36] D. M. Thomas, A. W. Leonard, L. L. Lao, T. H. Os- borne, Phys. Rev. Lett. 93, 065003 (2004); M. R. Wade, M. Murakami, and P. A. Politzer, Phys. Rev. Lett. 92, 235005 (2004). [37] Yu. P. Raizer, Gas Discharge Physics , (Springer, Berlin, 1991). [38] H. Alfven, C.-G. Falthammar, Cosmic Electrodynamic , (Oxford, Clarendon Press, 1963, Second Edition). [39] Yu. L. Klimontovich, Physics-Uspekhi 40, 21 (1997). [40] J. M. Borrero1 and L. R. Bellot Rubio, Astron. Astro- phys.385, 1056 (2002). [41] J. O. Stenﬂo, Sol. Phys. 32, 41 (1973). [42] J. S´ anchez Almeida and B. W. Lites, Astrophys. J. 532, 1215 (2000). [43] I. Dom´ ınguez Cerde˜ na, J. S´ anchez Almeida, F. Kneer, Astron. Astrophys. 407, 741 (2003). [44] T. E. Berger and A. M. Title, Astrophys. J. 553, 449 (2001). [45] A. A. van Ballegooijen, P. Nisenson, R. W. Noyes et al., Astron. Astrophys. 509, 435 (1998). [46] Z. Yi and O. Engvold, Sol. Phys. 144, 1 (1993). [47] A. M. Title and T. E. Berger, Astrophys. J. 463, 797 (1996). [48] E. V.Khomenko, M.Collados, S.K.Solanki, A.Laggand J. Trujillo Bueno, Astron. Astrophys. 408, 1115 (2003). [49] Itahiza Dominguez Cerdena, Jorge S´ anchez Almeida, Franz Kneer, astro-ph/0604381 (2006). [50] S. Almeida, Astrophys. J. 544, 1135 (2000). [51] M. F. Woodard, Jongchul Chae, Sol. Phys. 184, 239 (1999). [52] V. I. Abramenko, S. I. Gopasyuk, and M. B. Ogir. in Cosmic Researchs , edited by G. E. Kocharov, (Ioﬀe FTI, S. Petersburg, 1991), p. 192. [53] F. S. Mozer, C. W. Carlson, M. K. Hudson et al., Phys. Rev. Lett. 38, 292 ( 1977); F. S. Mozer, R. Ergun, M. Temerin et al., Phys. Rev. Lett. 79, 1281 (1997). R. E. Ergum, C. W. Carlson, J. P. McFadden et al., Phys. Rev. Lett. 81, 826 ( 1998); G. T. Marklund, N. Ivchenko, T. Karlsson et al., Nature (London) 414, 724 (2001). [54] T. D. Akhmetov, V. S. Belkin, E. D. Bender et al., Plasma Phys. Rep. 23, 911 ( 1997); T. D. Akhmetov, V. I. Davydenko, A. A. Kabantsev et al., Plasma Phys. Rep.24, 1000 (1998).\n",
  "metadata": {
    "paper_id": "astro-ph/0610885v1",
    "downloaded_at": "2025-08-29T16:24:26.225980+00:00"
  },
  "processed_at": "2025-08-29T16:24:26.226004+00:00"
}